[Killed] BlockStatement
src/algorithms/search-string.ts:110:28
   // compute the hash for the first <substring length> letters of the source
   // string
   let hash: Hash = generateHashFunction(sourceString.slice(0, substringLength));
-  if (hash === targetHash) {
-    // start index of zero if the first substring is a potential match
-    candidates.push(0);
-  }
+  if (hash === targetHash) {}
   let startCharacter: Character = sourceString.at(0)!;
 
killedBy: Rabin-Karp Substring Search can match at the start of the string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   0,
- ]

[Killed] EqualityOperator
src/algorithms/search-string.ts:119:19
   // roll the hash as we continue through the rest of the string up until the
   // last possible match position
   const sourceStringLength = sourceString.length;
-  for (let i = 1; i < sourceStringLength - substringLength + 1; i++) {
+  for (let i = 1; i >= sourceStringLength - substringLength + 1; i++) {
     hash = rollHashFunction(
       substringLength,
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]

[Killed] ArithmeticOperator
src/algorithms/search-string.ts:119:23
   // roll the hash as we continue through the rest of the string up until the
   // last possible match position
   const sourceStringLength = sourceString.length;
-  for (let i = 1; i < sourceStringLength - substringLength + 1; i++) {
+  for (let i = 1; i < sourceStringLength + substringLength + 1; i++) {
     hash = rollHashFunction(
       substringLength,
killedBy: Rabin-Karp Substring Search finds no matches when the substring is absent
statusReason: Error: Character code must be positive (the character lookup string must not be empty)

[Killed] ConditionalExpression
src/algorithms/search-string.ts:127:9
       sourceString.at(i + substringLength - 1)!,
     );
     startCharacter = sourceString.at(i)!;
-    if (hash === targetHash) {
+    if (true) {
       candidates.push(i);
     }
killedBy: Rabin-Karp Substring Search with simplified hash functions may create false matches prior to performing checks
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 8

  Array [
    1,
+   2,

[Killed] EqualityOperator
src/algorithms/search-string.ts:127:9
       sourceString.at(i + substringLength - 1)!,
     );
     startCharacter = sourceString.at(i)!;
-    if (hash === targetHash) {
+    if (hash !== targetHash) {
       candidates.push(i);
     }
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]
