[Killed] ConditionalExpression
src/data-structures/binary-search-tree.ts:43:11
     let previousNodeValue: T | null = null;
     let allUnique = true;
     BinaryTree.inOrderTraversal<T>((node) => {
-      if (node.data === previousNodeValue) {
+      if (true) {
         allUnique = false;
         return;
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns hasDuplicates === false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/data-structures/binary-search-tree.ts:43:44
     let previousNodeValue: T | null = null;
     let allUnique = true;
     BinaryTree.inOrderTraversal<T>((node) => {
-      if (node.data === previousNodeValue) {
-        allUnique = false;
-        return;
-      }
+      if (node.data === previousNodeValue) {}
       previousNodeValue = node.data;
     }, this.root);
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns hasDuplicates === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/data-structures/binary-search-tree.ts:50:9
       previousNodeValue = node.data;
     }, this.root);
 
-    if (!allUnique) {
+    if (true) {
       return true;
     }
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns hasDuplicates === false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/data-structures/binary-search-tree.ts:70:29
     index: number,
     totalNodes: number,
   ): boolean {
-    if (node === undefined) {
-      // base case: an empty tree is complete
-      return true;
-    }
+    if (node === undefined) {}
 
     if (index >= totalNodes) {
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isComplete === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/data-structures/binary-search-tree.ts:75:9
       return true;
     }
 
-    if (index >= totalNodes) {
+    if (index < totalNodes) {
       // a property of a complete tree is that when all nodes have indices
       // assigned using 2n+1 (left) and 2n+2 (right), each node's index will be
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isComplete === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/data-structures/binary-search-tree.ts:84:7
 
     return (
       // Stryker disable next-line ArithmeticOperator: mutant does not survive
-      this.#isCompleteInternal(node.left, 2 * index + 1, totalNodes) &&
-      this.#isCompleteInternal(node.right, 2 * index + 2, totalNodes)
+      // Stryker disable next-line ArithmeticOperator: mutant does not survive
+this.#isCompleteInternal(node.left, 2 * index + 1, totalNodes) || this.#isCompleteInternal(node.right, 2 * index + 2, totalNodes)
     );
   }
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isComplete === false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/data-structures/binary-search-tree.ts:96:9
 
   #isFullInternal(node?: BinaryTreeNode<T>): boolean {
     // perform an in-order traversal, returning false if any node has only one child
-    if (node === undefined) {
+    if (node !== undefined) {
       return true;
     }
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isFull === false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/data-structures/binary-search-tree.ts:96:9
 
   #isFullInternal(node?: BinaryTreeNode<T>): boolean {
     // perform an in-order traversal, returning false if any node has only one child
-    if (node === undefined) {
+    if (true) {
       return true;
     }
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isFull === false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/data-structures/binary-search-tree.ts:100:35
       return true;
     }
     if (
-      (node.left !== undefined && node.right === undefined) ||
+      (node.left !== undefined && node.right !== undefined) ||
       (node.right !== undefined && node.left === undefined)
     ) {
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isFull === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/data-structures/binary-search-tree.ts:101:8
     }
     if (
       (node.left !== undefined && node.right === undefined) ||
-      (node.right !== undefined && node.left === undefined)
+      (false)
     ) {
       return false;
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isFull === false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/data-structures/binary-search-tree.ts:105:12
     ) {
       return false;
     }
-    return this.#isFullInternal(node.left) && this.#isFullInternal(node.right);
+    return true;
   }
 
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isFull === false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/data-structures/binary-search-tree.ts:117:12
         maxDepth = depth;
       }
     }, this.root);
-    return count === Math.pow(2, maxDepth + 1) - 1;
+    return false;
   }
 
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isPerfect === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/data-structures/binary-search-tree.ts:117:34
         maxDepth = depth;
       }
     }, this.root);
-    return count === Math.pow(2, maxDepth + 1) - 1;
+    return count === Math.pow(2, maxDepth - 1) - 1;
   }
 
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isPerfect === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
