[Killed] BlockStatement
src/data-structures/doubly-linked-list.ts:54:42
     this.#root = newRoot;
   }
 
-  removeAfter(node: DoublyLinkedNode<T>) {
-    if (node.next === undefined) {
-      return;
-    }
-    const newNextNode = node.next.next;
-    deleteObjectProperties(node.next);
-    node.next = newNextNode;
-    if (newNextNode !== undefined) {
-      newNextNode.previous = node;
-    }
-  }
+  removeAfter(node: DoublyLinkedNode<T>) {}
 
   get root() {
killedBy: doubly linked list with 3 elements length is reduced by 1 after calling removeAfter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] EqualityOperator
src/data-structures/doubly-linked-list.ts:61:9
     const newNextNode = node.next.next;
     deleteObjectProperties(node.next);
     node.next = newNextNode;
-    if (newNextNode !== undefined) {
+    if (newNextNode === undefined) {
       newNextNode.previous = node;
     }
killedBy: doubly linked list (specific) removeAfter sets the previous node of the node following the removed node correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 36
+ Received  +  1

- DoublyLinkedNode {
-   "data": 5,
-   "next": DoublyLinkedNode {

[Killed] BlockStatement
src/data-structures/doubly-linked-list.ts:61:36
     const newNextNode = node.next.next;
     deleteObjectProperties(node.next);
     node.next = newNextNode;
-    if (newNextNode !== undefined) {
-      newNextNode.previous = node;
-    }
+    if (newNextNode !== undefined) {}
   }
 
killedBy: doubly linked list (specific) removeAfter sets the previous node of the node following the removed node correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 36
+ Received  +  1

- DoublyLinkedNode {
-   "data": 3,
-   "next": DoublyLinkedNode {

[Killed] ObjectLiteral
src/data-structures/doubly-linked-list.ts:87:24
         if (current === undefined) {
           return { value: undefined, done: true };
         }
-        const result = { value: current, done: false };
+        const result = {};
         current = current.next;
         return result;
killedBy: doubly linked list with many elements can iterate through list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
-   999,
-   998,
