[Killed] ConditionalExpression
src/data-structures/hash-table.ts:91:9
     const list = this.#array[index];
     // check if the list includes the key being stored and delete the list node
     // if so
-    if (list.root?.data[0] === key) {
+    if (true) {
       list.removeBeginning();
       return;
killedBy: hash table delete should not alter the table if the key is not found, even when the key collides with existing keys
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] EqualityOperator
src/data-structures/hash-table.ts:91:9
     const list = this.#array[index];
     // check if the list includes the key being stored and delete the list node
     // if so
-    if (list.root?.data[0] === key) {
+    if (list.root?.data[0] !== key) {
       list.removeBeginning();
       return;
killedBy: hash table delete should not alter the table if the key is not found, even when the key collides with existing keys
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] BlockStatement
src/data-structures/hash-table.ts:97:38
     }
     for (let node = list.root; node !== undefined; ) {
       const nextNode = node.next;
-      if (nextNode?.data[0] === key) {
-        list.removeAfter(node);
-        return;
-      }
+      if (nextNode?.data[0] === key) {}
       node = nextNode;
     }
killedBy: hash table delete should successfully delete an entry in a table with many collisions without affecting access to the remaining members
statusReason: KeyNotFoundError: Key not found: "entry3".

[Killed] ConditionalExpression
src/data-structures/hash-table.ts:103:9
       }
       node = nextNode;
     }
-    if (throwIfNotFound) {
+    if (true) {
       throw new KeyNotFoundError(key);
     }
killedBy: hash table delete should not alter the table if the key is not found, even when the key collides with existing keys
statusReason: KeyNotFoundError: Key not found: "doesn't exist".
