[Killed] BlockStatement
src/data-structures/skip-list.ts:345:36
     }
   }
 
-  #shiftToNewHead(newHeadValue: T) {
-    for (
-      let node: SkipListNode<T> | undefined = this.head;
-      node !== undefined;
-      node = node.down
-    ) {
-      node.data = newHeadValue;
-      const nextNode = node.next;
-      node.nextLength = !IsValidFiniteNumber(node.nextLength)
-        ? undefined
-        : node.nextLength! - 1;
-      // Stryker disable next-line ConditionalExpression: optimization
-      if (nextNode?.data === newHeadValue) {
-        // remove the next node since it will be a duplicate of the new head
-        // node
-        this.#removeNextNode(node, nextNode);
-        // undo the decrementing of node.nextLength, since we are removing a
-        // duplicate node
-        node.nextLength! += 1;
-      }
-    }
-  }
+  #shiftToNewHead(newHeadValue: T) {}
 
   #removeNextNode(node: SkipListNode<T>, nextNode: SkipListNode<T>) {
killedBy: skip list remove short fixed list completely removes the head column when targeting the head value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   1,
    2,

[Killed] BlockStatement
src/data-structures/skip-list.ts:350:7
       let node: SkipListNode<T> | undefined = this.head;
       node !== undefined;
       node = node.down
-    ) {
-      node.data = newHeadValue;
-      const nextNode = node.next;
-      node.nextLength = !IsValidFiniteNumber(node.nextLength)
-        ? undefined
-        : node.nextLength! - 1;
-      // Stryker disable next-line ConditionalExpression: optimization
-      if (nextNode?.data === newHeadValue) {
-        // remove the next node since it will be a duplicate of the new head
-        // node
-        this.#removeNextNode(node, nextNode);
-        // undo the decrementing of node.nextLength, since we are removing a
-        // duplicate node
-        node.nextLength! += 1;
-      }
-    }
+    ) {}
   }
 
killedBy: skip list remove short fixed list completely removes the head column when targeting the head value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   1,
    2,

[Killed] BlockStatement
src/data-structures/skip-list.ts:381:34
 
   get values(): ReadonlyArray<T> {
     const array: Array<T> = [];
-    if (this.head === undefined) {
-      return array;
-    }
+    if (this.head === undefined) {}
     let lowestHeadNode: SkipListNode<T> | undefined = this.head;
     while (lowestHeadNode.down !== undefined) {
killedBy: skip list constructor empty array collection parameter passed in values getter return an empty array for an empty skip list
statusReason: TypeError: Cannot read properties of undefined (reading 'down')

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:381:9
 
   get values(): ReadonlyArray<T> {
     const array: Array<T> = [];
-    if (this.head === undefined) {
+    if (true) {
       return array;
     }
killedBy: skip list constructor includes fixed collection params returns the correct values for the lowest layer
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   1,
-   2,
