[Killed] BlockStatement
src/algorithms/search-linear-collection.ts:15:10
 export function linearSearch<ElementType>(
   collection: Iterable<ElementType>,
   predicate: (element: ElementType) => boolean,
-): Index {
-  let idx: Index = 0;
-  for (const element of collection) {
-    if (predicate(element)) {
-      return idx;
-    }
-    idx += 1;
-  }
-  return -1;
-}
+): Index {}
 
 /* Binary search which searches for a value based on comparisons against
killedBy: linear search returns idx=-1 for value=0
       in [] - empty
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: -1
Received: undefined

[Killed] BlockStatement
src/algorithms/search-linear-collection.ts:17:37
   predicate: (element: ElementType) => boolean,
 ): Index {
   let idx: Index = 0;
-  for (const element of collection) {
-    if (predicate(element)) {
-      return idx;
-    }
-    idx += 1;
-  }
+  for (const element of collection) {}
   return -1;
 }
killedBy: linear search returns idx=0 for value=0
       in [0,1,2] - simple
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: -1

[Killed] ConditionalExpression
src/algorithms/search-linear-collection.ts:18:9
 ): Index {
   let idx: Index = 0;
   for (const element of collection) {
-    if (predicate(element)) {
+    if (false) {
       return idx;
     }
killedBy: linear search returns idx=0 for value=0
       in [0,1,2] - simple
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: -1

[Killed] ConditionalExpression
src/algorithms/search-linear-collection.ts:18:9
 ): Index {
   let idx: Index = 0;
   for (const element of collection) {
-    if (predicate(element)) {
+    if (true) {
       return idx;
     }
killedBy: linear search returns idx=2 for value=0
       in [-2,-1,0,1,2] - negative start
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 0

[Killed] AssignmentOperator
src/algorithms/search-linear-collection.ts:21:5
     if (predicate(element)) {
       return idx;
     }
-    idx += 1;
+    idx -= 1;
   }
   return -1;
killedBy: linear search returns idx=2 for value=0
       in [-2,-1,0,1,2] - negative start
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: -2

[Killed] BlockStatement
src/algorithms/search-linear-collection.ts:35:10
 >(
   collection: CollectionType,
   predicate: (element: ElementType) => number,
-): Index {
-  const isLessThan = (idx: Index) => {
-    return predicate(collection.at(idx)!) < 0;
-  };
-  const isGreaterThan = (idx: Index) => {
-    return predicate(collection.at(idx)!) > 0;
-  };
-
-  let low: Index = 0;
-  let high: Index = collection.length - 1;
-  let mid: Index;
-  while (low <= high) {
-    mid = low + Math.floor((high - low) / 2);
-    if (isGreaterThan(mid)) {
-      low = mid + 1;
-    } else if (isLessThan(mid)) {
-      high = mid - 1;
-    } else {
-      return mid;
-    }
-  }
-  return -1;
-}
+): Index {}
 
killedBy: binary search returns idx=-1 for value=0
       in [] - empty
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: -1
Received: undefined

[Killed] BlockStatement
src/algorithms/search-linear-collection.ts:36:38
   collection: CollectionType,
   predicate: (element: ElementType) => number,
 ): Index {
-  const isLessThan = (idx: Index) => {
-    return predicate(collection.at(idx)!) < 0;
-  };
+  const isLessThan = (idx: Index) => {};
   const isGreaterThan = (idx: Index) => {
     return predicate(collection.at(idx)!) > 0;
killedBy: binary search returns idx=0 for value=0
       in [0,1,2] - simple
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] EqualityOperator
src/algorithms/search-linear-collection.ts:37:12
   predicate: (element: ElementType) => number,
 ): Index {
   const isLessThan = (idx: Index) => {
-    return predicate(collection.at(idx)!) < 0;
+    return predicate(collection.at(idx)!) <= 0;
   };
   const isGreaterThan = (idx: Index) => {
killedBy: binary search returns idx=0 for value=0
       in [0,1,2] - simple
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: -1

[Killed] EqualityOperator
src/algorithms/search-linear-collection.ts:37:12
   predicate: (element: ElementType) => number,
 ): Index {
   const isLessThan = (idx: Index) => {
-    return predicate(collection.at(idx)!) < 0;
+    return predicate(collection.at(idx)!) >= 0;
   };
   const isGreaterThan = (idx: Index) => {
killedBy: binary search returns idx=0 for value=0
       in [0,1,2] - simple
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] BlockStatement
src/algorithms/search-linear-collection.ts:39:41
   const isLessThan = (idx: Index) => {
     return predicate(collection.at(idx)!) < 0;
   };
-  const isGreaterThan = (idx: Index) => {
-    return predicate(collection.at(idx)!) > 0;
-  };
+  const isGreaterThan = (idx: Index) => {};
 
   let low: Index = 0;
killedBy: binary search returns idx=3 for value=-2
       in [-5,-4,-3,-2,-1] - negative throughout
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 3
Received: 2

[Killed] EqualityOperator
src/algorithms/search-linear-collection.ts:40:12
     return predicate(collection.at(idx)!) < 0;
   };
   const isGreaterThan = (idx: Index) => {
-    return predicate(collection.at(idx)!) > 0;
+    return predicate(collection.at(idx)!) >= 0;
   };
 
killedBy: binary search returns idx=0 for value=0
       in [0,1,2] - simple
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: -1

[Killed] ConditionalExpression
src/algorithms/search-linear-collection.ts:40:12
     return predicate(collection.at(idx)!) < 0;
   };
   const isGreaterThan = (idx: Index) => {
-    return predicate(collection.at(idx)!) > 0;
+    return false;
   };
 
killedBy: binary search returns idx=3 for value=-2
       in [-5,-4,-3,-2,-1] - negative throughout
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 3
Received: 2

[Killed] ArithmeticOperator
src/algorithms/search-linear-collection.ts:44:21
   };
 
   let low: Index = 0;
-  let high: Index = collection.length - 1;
+  let high: Index = collection.length + 1;
   let mid: Index;
   while (low <= high) {
killedBy: binary search returns idx=-1 for value=0
       in [] - empty
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: -1
Received: 0

[Killed] EqualityOperator
src/algorithms/search-linear-collection.ts:46:10
   let low: Index = 0;
   let high: Index = collection.length - 1;
   let mid: Index;
-  while (low <= high) {
+  while (low < high) {
     mid = low + Math.floor((high - low) / 2);
     if (isGreaterThan(mid)) {
killedBy: binary search returns idx=0 for value=0
       in [0,1,2] - simple
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: -1

[Killed] EqualityOperator
src/algorithms/search-linear-collection.ts:46:10
   let low: Index = 0;
   let high: Index = collection.length - 1;
   let mid: Index;
-  while (low <= high) {
+  while (low > high) {
     mid = low + Math.floor((high - low) / 2);
     if (isGreaterThan(mid)) {
killedBy: binary search returns idx=0 for value=0
       in [0,1,2] - simple
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: -1

[Killed] ArithmeticOperator
src/algorithms/search-linear-collection.ts:47:28
   let high: Index = collection.length - 1;
   let mid: Index;
   while (low <= high) {
-    mid = low + Math.floor((high - low) / 2);
+    mid = low + Math.floor((high - low) * 2);
     if (isGreaterThan(mid)) {
       low = mid + 1;
killedBy: binary search returns idx=0 for value=0
       in [0,1,2] - simple
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 4

[Killed] ArithmeticOperator
src/algorithms/search-linear-collection.ts:47:11
   let high: Index = collection.length - 1;
   let mid: Index;
   while (low <= high) {
-    mid = low + Math.floor((high - low) / 2);
+    mid = low - Math.floor((high - low) / 2);
     if (isGreaterThan(mid)) {
       low = mid + 1;
killedBy: binary search returns idx=0 for value=0
       in [0,1,2] - simple
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: -1

[Killed] ConditionalExpression
src/algorithms/search-linear-collection.ts:48:9
   let mid: Index;
   while (low <= high) {
     mid = low + Math.floor((high - low) / 2);
-    if (isGreaterThan(mid)) {
+    if (false) {
       low = mid + 1;
     } else if (isLessThan(mid)) {
killedBy: binary search returns idx=3 for value=-2
       in [-5,-4,-3,-2,-1] - negative throughout
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 3
Received: 2

[Killed] ConditionalExpression
src/algorithms/search-linear-collection.ts:48:9
   let mid: Index;
   while (low <= high) {
     mid = low + Math.floor((high - low) / 2);
-    if (isGreaterThan(mid)) {
+    if (true) {
       low = mid + 1;
     } else if (isLessThan(mid)) {
killedBy: binary search returns idx=0 for value=0
       in [0,1,2] - simple
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: -1

[Timeout] ArithmeticOperator
src/algorithms/search-linear-collection.ts:49:13
   while (low <= high) {
     mid = low + Math.floor((high - low) / 2);
     if (isGreaterThan(mid)) {
-      low = mid + 1;
+      low = mid - 1;
     } else if (isLessThan(mid)) {
       high = mid - 1;

[Killed] ConditionalExpression
src/algorithms/search-linear-collection.ts:50:16
     mid = low + Math.floor((high - low) / 2);
     if (isGreaterThan(mid)) {
       low = mid + 1;
-    } else if (isLessThan(mid)) {
+    } else if (false) {
       high = mid - 1;
     } else {
killedBy: binary search returns idx=0 for value=0
       in [0,1,2] - simple
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/algorithms/search-linear-collection.ts:50:16
     mid = low + Math.floor((high - low) / 2);
     if (isGreaterThan(mid)) {
       low = mid + 1;
-    } else if (isLessThan(mid)) {
+    } else if (true) {
       high = mid - 1;
     } else {
killedBy: binary search returns idx=0 for value=0
       in [0,1,2] - simple
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: -1

[Timeout] ArithmeticOperator
src/algorithms/search-linear-collection.ts:51:14
     if (isGreaterThan(mid)) {
       low = mid + 1;
     } else if (isLessThan(mid)) {
-      high = mid - 1;
+      high = mid + 1;
     } else {
       return mid;

[Timeout] BlockStatement
src/algorithms/search-linear-collection.ts:52:12
       low = mid + 1;
     } else if (isLessThan(mid)) {
       high = mid - 1;
-    } else {
-      return mid;
-    }
+    } else {}
   }
   return -1;
