[Killed] BlockStatement
src/algorithms/search-string.ts:23:57
 // Max symbol code value is 95, which I'm rounding up to base 128 (2^7)
 export const base = 128;
 
-export const getCodeForCharacter = (char: Character) => {
-  const code = BigInt(orderedCharacters.indexOf(char));
-  // Stryker disable next-line all: prevents assignment of character lookup string to an empty string
-  if (code === BigInt(-1)) {
-    throw new Error(
-      // Stryker disable next-line all
-      "Character code must be positive (the character lookup string must not be empty)",
-    );
-  }
-  return code;
-};
+export const getCodeForCharacter = (char: Character) => {};
 
 export const getRabinFingerprintHash = (substring: string): Hash => {
killedBy: Rabin-Karp Substring Search finds no matches when the substring is absent
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] BlockStatement
src/algorithms/search-string.ts:35:69
   return code;
 };
 
-export const getRabinFingerprintHash = (substring: string): Hash => {
-  let hashValue: Hash = BigInt(0);
-  for (let i = 0; i < substring.length; i++) {
-    hashValue +=
-      getCodeForCharacter(substring.at(i)!) *
-      BigInt(base ** (substring.length - 1 - i));
-  }
-  return hashValue;
-};
+export const getRabinFingerprintHash = (substring: string): Hash => {};
 
 const rollRabinFingerprintHash = (
killedBy: Rabin-Karp Substring Search finds no matches when the substring is absent
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] BlockStatement
src/algorithms/search-string.ts:37:46
 
 export const getRabinFingerprintHash = (substring: string): Hash => {
   let hashValue: Hash = BigInt(0);
-  for (let i = 0; i < substring.length; i++) {
-    hashValue +=
-      getCodeForCharacter(substring.at(i)!) *
-      BigInt(base ** (substring.length - 1 - i));
-  }
+  for (let i = 0; i < substring.length; i++) {}
   return hashValue;
 };
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]

[Killed] UpdateOperator
src/algorithms/search-string.ts:37:41
 
 export const getRabinFingerprintHash = (substring: string): Hash => {
   let hashValue: Hash = BigInt(0);
-  for (let i = 0; i < substring.length; i++) {
+  for (let i = 0; i < substring.length; i--) {
     hashValue +=
       getCodeForCharacter(substring.at(i)!) *
killedBy: Rabin-Karp Substring Search finds no matches when the substring is absent
statusReason: Error: Character code must be positive (the character lookup string must not be empty)

[Killed] AssignmentOperator
src/algorithms/search-string.ts:38:5
 export const getRabinFingerprintHash = (substring: string): Hash => {
   let hashValue: Hash = BigInt(0);
   for (let i = 0; i < substring.length; i++) {
-    hashValue +=
-      getCodeForCharacter(substring.at(i)!) *
-      BigInt(base ** (substring.length - 1 - i));
+    hashValue -= getCodeForCharacter(substring.at(i)!) * BigInt(base ** (substring.length - 1 - i));
   }
   return hashValue;
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]

[Killed] ArithmeticOperator
src/algorithms/search-string.ts:39:7
   let hashValue: Hash = BigInt(0);
   for (let i = 0; i < substring.length; i++) {
     hashValue +=
-      getCodeForCharacter(substring.at(i)!) *
-      BigInt(base ** (substring.length - 1 - i));
+      getCodeForCharacter(substring.at(i)!) / BigInt(base ** (substring.length - 1 - i));
   }
   return hashValue;
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]

[Killed] ArithmeticOperator
src/algorithms/search-string.ts:40:23
   for (let i = 0; i < substring.length; i++) {
     hashValue +=
       getCodeForCharacter(substring.at(i)!) *
-      BigInt(base ** (substring.length - 1 - i));
+      BigInt(base ** (substring.length - 1 + i));
   }
   return hashValue;
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]

[Killed] ArithmeticOperator
src/algorithms/search-string.ts:40:23
   for (let i = 0; i < substring.length; i++) {
     hashValue +=
       getCodeForCharacter(substring.at(i)!) *
-      BigInt(base ** (substring.length - 1 - i));
+      BigInt(base ** (substring.length + 1 - i));
   }
   return hashValue;
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]

[Killed] BlockStatement
src/algorithms/search-string.ts:50:12
   hash: Hash,
   startCharacter: Character,
   endCharacter: Character,
-): Hash => {
-  let resultHash = hash;
-  resultHash -=
-    getCodeForCharacter(startCharacter) * BigInt(base ** (substringLength - 1));
-  resultHash *= BigInt(base);
-  resultHash += getCodeForCharacter(endCharacter);
-  return resultHash;
-};
+): Hash => {};
 
 export const rabinKarpSubstringSearch = (
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]

[Killed] AssignmentOperator
src/algorithms/search-string.ts:52:3
   endCharacter: Character,
 ): Hash => {
   let resultHash = hash;
-  resultHash -=
-    getCodeForCharacter(startCharacter) * BigInt(base ** (substringLength - 1));
+  resultHash += getCodeForCharacter(startCharacter) * BigInt(base ** (substringLength - 1));
   resultHash *= BigInt(base);
   resultHash += getCodeForCharacter(endCharacter);
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]

[Killed] ArithmeticOperator
src/algorithms/search-string.ts:53:59
 ): Hash => {
   let resultHash = hash;
   resultHash -=
-    getCodeForCharacter(startCharacter) * BigInt(base ** (substringLength - 1));
+    getCodeForCharacter(startCharacter) * BigInt(base ** (substringLength + 1));
   resultHash *= BigInt(base);
   resultHash += getCodeForCharacter(endCharacter);
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]

[Killed] ArithmeticOperator
src/algorithms/search-string.ts:53:5
 ): Hash => {
   let resultHash = hash;
   resultHash -=
-    getCodeForCharacter(startCharacter) * BigInt(base ** (substringLength - 1));
+    getCodeForCharacter(startCharacter) / BigInt(base ** (substringLength - 1));
   resultHash *= BigInt(base);
   resultHash += getCodeForCharacter(endCharacter);
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]

[Killed] AssignmentOperator
src/algorithms/search-string.ts:54:3
   let resultHash = hash;
   resultHash -=
     getCodeForCharacter(startCharacter) * BigInt(base ** (substringLength - 1));
-  resultHash *= BigInt(base);
+  resultHash /= BigInt(base);
   resultHash += getCodeForCharacter(endCharacter);
   return resultHash;
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]

[Killed] AssignmentOperator
src/algorithms/search-string.ts:55:3
   resultHash -=
     getCodeForCharacter(startCharacter) * BigInt(base ** (substringLength - 1));
   resultHash *= BigInt(base);
-  resultHash += getCodeForCharacter(endCharacter);
+  resultHash -= getCodeForCharacter(endCharacter);
   return resultHash;
 };
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]

[Killed] BlockStatement
src/algorithms/search-string.ts:69:6
     startCharacter: Character,
     endCharacter: Character,
   ) => Hash = rollRabinFingerprintHash,
-) => {
-  let candidates = getRabinKarpSearchCandidates(
-    sourceString,
-    substring,
-    generateHashFunction,
-    rollHashFunction,
-  );
-
-  // filter out candidates which do not match
-  candidates = candidates.filter((candidate) => {
-    const candidateSubstring = sourceString.substring(
-      candidate,
-      candidate + substring.length,
-    );
-    return candidateSubstring === substring;
-  });
-
-  return candidates;
-};
+) => {};
 
 export const getRabinKarpSearchCandidates = (
killedBy: Rabin-Karp Substring Search finds no matches when the substring is absent
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
src/algorithms/search-string.ts:78:16
   );
 
   // filter out candidates which do not match
-  candidates = candidates.filter((candidate) => {
-    const candidateSubstring = sourceString.substring(
-      candidate,
-      candidate + substring.length,
-    );
-    return candidateSubstring === substring;
-  });
+  candidates = candidates;
 
   return candidates;
killedBy: Rabin-Karp Substring Search with simplified hash functions checks for false matches
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 3

  Array [
+   1,
    4,

[Killed] BlockStatement
src/algorithms/search-string.ts:78:49
   );
 
   // filter out candidates which do not match
-  candidates = candidates.filter((candidate) => {
-    const candidateSubstring = sourceString.substring(
-      candidate,
-      candidate + substring.length,
-    );
-    return candidateSubstring === substring;
-  });
+  candidates = candidates.filter((candidate) => {});
 
   return candidates;
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]

[Killed] MethodExpression
src/algorithms/search-string.ts:79:32
 
   // filter out candidates which do not match
   candidates = candidates.filter((candidate) => {
-    const candidateSubstring = sourceString.substring(
-      candidate,
-      candidate + substring.length,
-    );
+    const candidateSubstring = sourceString;
     return candidateSubstring === substring;
   });
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]

[Killed] ArithmeticOperator
src/algorithms/search-string.ts:81:7
   candidates = candidates.filter((candidate) => {
     const candidateSubstring = sourceString.substring(
       candidate,
-      candidate + substring.length,
+      candidate - substring.length,
     );
     return candidateSubstring === substring;
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]

[Killed] ConditionalExpression
src/algorithms/search-string.ts:83:12
       candidate,
       candidate + substring.length,
     );
-    return candidateSubstring === substring;
+    return false;
   });
 
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]

[Killed] EqualityOperator
src/algorithms/search-string.ts:83:12
       candidate,
       candidate + substring.length,
     );
-    return candidateSubstring === substring;
+    return candidateSubstring !== substring;
   });
 
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]

[Killed] MethodExpression
src/algorithms/search-string.ts:110:41
 
   // compute the hash for the first <substring length> letters of the source
   // string
-  let hash: Hash = generateHashFunction(sourceString.slice(0, substringLength));
+  let hash: Hash = generateHashFunction(sourceString);
   if (hash === targetHash) {
     // start index of zero if the first substring is a potential match
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]

[Killed] EqualityOperator
src/algorithms/search-string.ts:111:7
   // compute the hash for the first <substring length> letters of the source
   // string
   let hash: Hash = generateHashFunction(sourceString.slice(0, substringLength));
-  if (hash === targetHash) {
+  if (hash !== targetHash) {
     // start index of zero if the first substring is a potential match
     candidates.push(0);
killedBy: Rabin-Karp Substring Search can match at the start of the string
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   0,
- ]

[Killed] ConditionalExpression
src/algorithms/search-string.ts:111:7
   // compute the hash for the first <substring length> letters of the source
   // string
   let hash: Hash = generateHashFunction(sourceString.slice(0, substringLength));
-  if (hash === targetHash) {
+  if (true) {
     // start index of zero if the first substring is a potential match
     candidates.push(0);
killedBy: Rabin-Karp Substring Search with simplified hash functions may create false matches prior to performing checks
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   0,
    1,

[Killed] EqualityOperator
src/algorithms/search-string.ts:120:19
   // roll the hash as we continue through the rest of the string up until the
   // last possible match position
   const sourceStringLength = sourceString.length;
-  for (let i = 1; i < sourceStringLength - substringLength + 1; i++) {
+  for (let i = 1; i <= sourceStringLength - substringLength + 1; i++) {
     hash = rollHashFunction(
       substringLength,
killedBy: Rabin-Karp Substring Search finds no matches when the substring is absent
statusReason: Error: Character code must be positive (the character lookup string must not be empty)

[Killed] ConditionalExpression
src/algorithms/search-string.ts:120:19
   // roll the hash as we continue through the rest of the string up until the
   // last possible match position
   const sourceStringLength = sourceString.length;
-  for (let i = 1; i < sourceStringLength - substringLength + 1; i++) {
+  for (let i = 1; false; i++) {
     hash = rollHashFunction(
       substringLength,
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]

[Killed] ArithmeticOperator
src/algorithms/search-string.ts:125:23
       substringLength,
       hash,
       startCharacter,
-      sourceString.at(i + substringLength - 1)!,
+      sourceString.at(i - substringLength - 1)!,
     );
     startCharacter = sourceString.at(i)!;
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]

[Killed] ArithmeticOperator
src/algorithms/search-string.ts:125:23
       substringLength,
       hash,
       startCharacter,
-      sourceString.at(i + substringLength - 1)!,
+      sourceString.at(i + substringLength + 1)!,
     );
     startCharacter = sourceString.at(i)!;
killedBy: Rabin-Karp Substring Search finds no matches when the substring is absent
statusReason: Error: Character code must be positive (the character lookup string must not be empty)

[Killed] ConditionalExpression
src/algorithms/search-string.ts:128:9
       sourceString.at(i + substringLength - 1)!,
     );
     startCharacter = sourceString.at(i)!;
-    if (hash === targetHash) {
+    if (false) {
       candidates.push(i);
     }
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]

[Killed] BlockStatement
src/algorithms/search-string.ts:128:30
       sourceString.at(i + substringLength - 1)!,
     );
     startCharacter = sourceString.at(i)!;
-    if (hash === targetHash) {
-      candidates.push(i);
-    }
+    if (hash === targetHash) {}
   }
 
killedBy: Rabin-Karp Substring Search can match digits
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   3,
- ]
