[Killed] ConditionalExpression
src/algorithms/sort-linear-collection.ts:25:19
 ) {
   let minimum: ElementType | undefined;
   let minimumIndex: Index | undefined;
-  for (let i = 0; i < collection.length; i++) {
+  for (let i = 0; false; i++) {
     minimum = undefined;
     minimumIndex = undefined;
killedBy: selection sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [5157, 4072]

[Killed] BlockStatement
src/algorithms/sort-linear-collection.ts:25:47
 ) {
   let minimum: ElementType | undefined;
   let minimumIndex: Index | undefined;
-  for (let i = 0; i < collection.length; i++) {
-    minimum = undefined;
-    minimumIndex = undefined;
-    // Stryker disable next-line EqualityOperator: null reference
-    for (let j = i; j < collection.length; j++) {
-      const next = collection.at(j);
-      if (minimum === undefined) {
-        minimum = next;
-        minimumIndex = j;
-        continue;
-      }
-      // Stryker disable next-line EqualityOperator: cannot test with immutable elements, not critical
-      if (minimum! > next!) {
-        minimum = next;
-        minimumIndex = j;
-        continue;
-      }
-    }
-    // Stryker disable next-line all: optimization, not critical
-    if (minimumIndex === i) {
-      // no need for a swap, since the minimum is already in the correct spot
-      continue;
-    }
-    swapFunction(collection, minimumIndex!, i);
-  }
+  for (let i = 0; i < collection.length; i++) {}
 }
 
killedBy: selection sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [8027, 7848]

[Killed] BlockStatement
src/algorithms/sort-linear-collection.ts:29:49
     minimum = undefined;
     minimumIndex = undefined;
     // Stryker disable next-line EqualityOperator: null reference
-    for (let j = i; j < collection.length; j++) {
-      const next = collection.at(j);
-      if (minimum === undefined) {
-        minimum = next;
-        minimumIndex = j;
-        continue;
-      }
-      // Stryker disable next-line EqualityOperator: cannot test with immutable elements, not critical
-      if (minimum! > next!) {
-        minimum = next;
-        minimumIndex = j;
-        continue;
-      }
-    }
+    for (let j = i; j < collection.length; j++) {}
     // Stryker disable next-line all: optimization, not critical
     if (minimumIndex === i) {
killedBy: selection sort does nothing when called on an array with 1 element
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   0,
+   undefined,

[Killed] ConditionalExpression
src/algorithms/sort-linear-collection.ts:29:21
     minimum = undefined;
     minimumIndex = undefined;
     // Stryker disable next-line EqualityOperator: null reference
-    for (let j = i; j < collection.length; j++) {
+    for (let j = i; false; j++) {
       const next = collection.at(j);
       if (minimum === undefined) {
killedBy: selection sort does nothing when called on an array with 1 element
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   0,
+   undefined,

[Killed] ConditionalExpression
src/algorithms/sort-linear-collection.ts:31:11
     // Stryker disable next-line EqualityOperator: null reference
     for (let j = i; j < collection.length; j++) {
       const next = collection.at(j);
-      if (minimum === undefined) {
+      if (true) {
         minimum = next;
         minimumIndex = j;
killedBy: selection sort sorts through the final element of the input array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/algorithms/sort-linear-collection.ts:31:11
     // Stryker disable next-line EqualityOperator: null reference
     for (let j = i; j < collection.length; j++) {
       const next = collection.at(j);
-      if (minimum === undefined) {
+      if (false) {
         minimum = next;
         minimumIndex = j;
killedBy: selection sort does nothing when called on an array with 1 element
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   0,
+   undefined,

[Killed] BlockStatement
src/algorithms/sort-linear-collection.ts:37:29
         continue;
       }
       // Stryker disable next-line EqualityOperator: cannot test with immutable elements, not critical
-      if (minimum! > next!) {
-        minimum = next;
-        minimumIndex = j;
-        continue;
-      }
+      if (minimum! > next!) {}
     }
     // Stryker disable next-line all: optimization, not critical
killedBy: selection sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [7431, 393]

[Killed] ConditionalExpression
src/algorithms/sort-linear-collection.ts:37:11
         continue;
       }
       // Stryker disable next-line EqualityOperator: cannot test with immutable elements, not critical
-      if (minimum! > next!) {
+      if (false) {
         minimum = next;
         minimumIndex = j;
killedBy: selection sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [5547, 1943]

[Killed] BlockStatement
src/algorithms/sort-linear-collection.ts:61:3
 export function bubbleSort<ElementType>(
   collection: Collection<ElementType>,
   swapFunction: CollectionSwapFunction<ElementType>,
-) {
-  // Stryker disable ArithmeticOperator, EqualityOperator
-  for (let i = collection.length - 1; i > 0; i--) {
-    for (let j = 0; j < i; j++) {
-      if (collection.at(j)! > collection.at(j + 1)!) {
-        swapFunction(collection, j, j + 1);
-      }
-    }
-  }
-  // Stryker enable all
-}
+) {}
 
 /* Merge Sort (Recursive): Recursive algorithm which sorts a list by performing
killedBy: bubble sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [714, 503]

[Killed] ConditionalExpression
src/algorithms/sort-linear-collection.ts:63:39
   swapFunction: CollectionSwapFunction<ElementType>,
 ) {
   // Stryker disable ArithmeticOperator, EqualityOperator
-  for (let i = collection.length - 1; i > 0; i--) {
+  for (let i = collection.length - 1; false; i--) {
     for (let j = 0; j < i; j++) {
       if (collection.at(j)! > collection.at(j + 1)!) {
killedBy: bubble sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [6122, 1796]

[Killed] BlockStatement
src/algorithms/sort-linear-collection.ts:63:51
   swapFunction: CollectionSwapFunction<ElementType>,
 ) {
   // Stryker disable ArithmeticOperator, EqualityOperator
-  for (let i = collection.length - 1; i > 0; i--) {
-    for (let j = 0; j < i; j++) {
-      if (collection.at(j)! > collection.at(j + 1)!) {
-        swapFunction(collection, j, j + 1);
-      }
-    }
-  }
+  for (let i = collection.length - 1; i > 0; i--) {}
   // Stryker enable all
 }
killedBy: bubble sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [926, 412]

[Killed] BlockStatement
src/algorithms/sort-linear-collection.ts:64:33
 ) {
   // Stryker disable ArithmeticOperator, EqualityOperator
   for (let i = collection.length - 1; i > 0; i--) {
-    for (let j = 0; j < i; j++) {
-      if (collection.at(j)! > collection.at(j + 1)!) {
-        swapFunction(collection, j, j + 1);
-      }
-    }
+    for (let j = 0; j < i; j++) {}
   }
   // Stryker enable all
killedBy: bubble sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [2329, 1202]

[Killed] ConditionalExpression
src/algorithms/sort-linear-collection.ts:64:21
 ) {
   // Stryker disable ArithmeticOperator, EqualityOperator
   for (let i = collection.length - 1; i > 0; i--) {
-    for (let j = 0; j < i; j++) {
+    for (let j = 0; false; j++) {
       if (collection.at(j)! > collection.at(j + 1)!) {
         swapFunction(collection, j, j + 1);
killedBy: bubble sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [6128, 4052]

[Killed] BlockStatement
src/algorithms/sort-linear-collection.ts:65:54
   // Stryker disable ArithmeticOperator, EqualityOperator
   for (let i = collection.length - 1; i > 0; i--) {
     for (let j = 0; j < i; j++) {
-      if (collection.at(j)! > collection.at(j + 1)!) {
-        swapFunction(collection, j, j + 1);
-      }
+      if (collection.at(j)! > collection.at(j + 1)!) {}
     }
   }
killedBy: bubble sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [5184, 2506]

[Killed] ConditionalExpression
src/algorithms/sort-linear-collection.ts:65:11
   // Stryker disable ArithmeticOperator, EqualityOperator
   for (let i = collection.length - 1; i > 0; i--) {
     for (let j = 0; j < i; j++) {
-      if (collection.at(j)! > collection.at(j + 1)!) {
+      if (true) {
         swapFunction(collection, j, j + 1);
       }
killedBy: bubble sort sorts through the final element of the input array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/algorithms/sort-linear-collection.ts:90:39
   function merge(low: Index, middle: Index, high: Index): void {
     // Overwrite the relevant portion of the helper array (low <= i <= high)
     // with elements from the input array
-    for (let i = low; i <= high; i++) {
-      copyToFunction(collection, helper, i, i);
-    }
+    for (let i = low; i <= high; i++) {}
     let helperLeftLow = low;
     let helperRightLow = middle + 1;
killedBy: merge sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 759
Received: undefined

[Killed] ConditionalExpression
src/algorithms/sort-linear-collection.ts:90:23
   function merge(low: Index, middle: Index, high: Index): void {
     // Overwrite the relevant portion of the helper array (low <= i <= high)
     // with elements from the input array
-    for (let i = low; i <= high; i++) {
+    for (let i = low; false; i++) {
       copyToFunction(collection, helper, i, i);
     }
killedBy: merge sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 58
Received: undefined

[Killed] ConditionalExpression
src/algorithms/sort-linear-collection.ts:98:12
     let current = low;
     // Merge from the helper array into the original array, selecting between
     // the lowest unmerged elements of each subarray with each iteration.
-    while (helperLeftLow <= middle && helperRightLow <= high) {
+    while (true && helperRightLow <= high) {
       if (helper.at(helperLeftLow)! <= helper.at(helperRightLow)!) {
         copyToFunction(helper, collection, helperLeftLow, current);
killedBy: merge sort returns the same order of elements when the input array is already sorted
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 7

  Array [
    0,
    1,

[Killed] ConditionalExpression
src/algorithms/sort-linear-collection.ts:98:12
     let current = low;
     // Merge from the helper array into the original array, selecting between
     // the lowest unmerged elements of each subarray with each iteration.
-    while (helperLeftLow <= middle && helperRightLow <= high) {
+    while (false) {
       if (helper.at(helperLeftLow)! <= helper.at(helperRightLow)!) {
         copyToFunction(helper, collection, helperLeftLow, current);
killedBy: merge sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [6321, 2309]

[Killed] ConditionalExpression
src/algorithms/sort-linear-collection.ts:99:11
     // Merge from the helper array into the original array, selecting between
     // the lowest unmerged elements of each subarray with each iteration.
     while (helperLeftLow <= middle && helperRightLow <= high) {
-      if (helper.at(helperLeftLow)! <= helper.at(helperRightLow)!) {
+      if (false) {
         copyToFunction(helper, collection, helperLeftLow, current);
         helperLeftLow += 1;
killedBy: merge sort sorts through the final element of the input array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/algorithms/sort-linear-collection.ts:99:11
     // Merge from the helper array into the original array, selecting between
     // the lowest unmerged elements of each subarray with each iteration.
     while (helperLeftLow <= middle && helperRightLow <= high) {
-      if (helper.at(helperLeftLow)! <= helper.at(helperRightLow)!) {
+      if (true) {
         copyToFunction(helper, collection, helperLeftLow, current);
         helperLeftLow += 1;
killedBy: merge sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [1243, 1203]

[Killed] AssignmentOperator
src/algorithms/sort-linear-collection.ts:101:9
     while (helperLeftLow <= middle && helperRightLow <= high) {
       if (helper.at(helperLeftLow)! <= helper.at(helperRightLow)!) {
         copyToFunction(helper, collection, helperLeftLow, current);
-        helperLeftLow += 1;
+        helperLeftLow -= 1;
       } else {
         copyToFunction(helper, collection, helperRightLow, current);
killedBy: merge sort returns the same order of elements when the input array is already sorted
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  -  5
+ Received  + 11

  Array [
+   undefined,
+   0,

[Timeout] BlockStatement
src/algorithms/sort-linear-collection.ts:102:14
       if (helper.at(helperLeftLow)! <= helper.at(helperRightLow)!) {
         copyToFunction(helper, collection, helperLeftLow, current);
         helperLeftLow += 1;
-      } else {
-        copyToFunction(helper, collection, helperRightLow, current);
-        helperRightLow += 1;
-      }
+      } else {}
       current += 1;
     }

[Killed] AssignmentOperator
src/algorithms/sort-linear-collection.ts:104:9
         helperLeftLow += 1;
       } else {
         copyToFunction(helper, collection, helperRightLow, current);
-        helperRightLow += 1;
+        helperRightLow -= 1;
       }
       current += 1;
killedBy: merge sort sorts through the final element of the input array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] AssignmentOperator
src/algorithms/sort-linear-collection.ts:106:7
         copyToFunction(helper, collection, helperRightLow, current);
         helperRightLow += 1;
       }
-      current += 1;
+      current -= 1;
     }
     // Merge the remaining elements, which will always be from the left subarray
killedBy: merge sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6682
Received: 1634

[Killed] ConditionalExpression
src/algorithms/sort-linear-collection.ts:111:21
     // Merge the remaining elements, which will always be from the left subarray
     // if present, since we are merging from lowest value to highest.
     const remaining = middle - helperLeftLow;
-    for (let i = 0; i <= remaining; i++) {
+    for (let i = 0; false; i++) {
       copyToFunction(helper, collection, helperLeftLow + i, current + i);
     }
killedBy: merge sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6543
Received: 4992

[Killed] BlockStatement
src/algorithms/sort-linear-collection.ts:111:42
     // Merge the remaining elements, which will always be from the left subarray
     // if present, since we are merging from lowest value to highest.
     const remaining = middle - helperLeftLow;
-    for (let i = 0; i <= remaining; i++) {
-      copyToFunction(helper, collection, helperLeftLow + i, current + i);
-    }
+    for (let i = 0; i <= remaining; i++) {}
   }
 
killedBy: merge sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6174
Received: 5694

[Killed] BlockStatement
src/algorithms/sort-linear-collection.ts:116:58
     }
   }
 
-  function mergeSortInner(low: Index, high: Index): void {
-    if (low >= high) {
-      // 1-element array is already sorted
-      return;
-    }
-    // Divide
-    const middle: Index = low + Math.floor((high - low) / 2);
-    // Conquer
-    mergeSortInner(low, middle);
-    mergeSortInner(middle + 1, high);
-    // Combine
-    merge(low, middle, high);
-  }
+  function mergeSortInner(low: Index, high: Index): void {}
 
   // Initial sort call
killedBy: merge sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [7755, 681]

[Killed] ConditionalExpression
src/algorithms/sort-linear-collection.ts:117:9
   }
 
   function mergeSortInner(low: Index, high: Index): void {
-    if (low >= high) {
+    if (true) {
       // 1-element array is already sorted
       return;
killedBy: merge sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [3079, 1981]
