[Killed] BlockStatement
src/algorithms/sort-radix.ts:9:53
  * bins. This implementation works on arrays of positive integers, sorting them using
  * their digits starting from the least significant digit.
  */
-export const getNumberOfDigits = (value: number) => {
-  // 10^n is < the input until n equals the number of digits of the input (only
-  // works for positive integers)
-  if (!Number.isInteger(value) || value < 0) {
-    throw new ExpectedPositiveIntegerError(value);
-  }
-  let exp = 1;
-  while (10 ** exp <= value) {
-    exp += 1;
-  }
-  return exp;
-};
+export const getNumberOfDigits = (value: number) => {};
 
 export const getDigit = (value: number, fromRightIdx: Index) => {
killedBy: getNumberOfDigits throws an error for non-positive integer input for the value arg
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/algorithms/sort-radix.ts:12:7
 export const getNumberOfDigits = (value: number) => {
   // 10^n is < the input until n equals the number of digits of the input (only
   // works for positive integers)
-  if (!Number.isInteger(value) || value < 0) {
+  if (false) {
     throw new ExpectedPositiveIntegerError(value);
   }
killedBy: getNumberOfDigits throws an error for non-positive integer input for the value arg
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] EqualityOperator
src/algorithms/sort-radix.ts:12:35
 export const getNumberOfDigits = (value: number) => {
   // 10^n is < the input until n equals the number of digits of the input (only
   // works for positive integers)
-  if (!Number.isInteger(value) || value < 0) {
+  if (!Number.isInteger(value) || value <= 0) {
     throw new ExpectedPositiveIntegerError(value);
   }
killedBy: getNumberOfDigits returns 1 digit for 0
statusReason: ExpectedPositiveIntegerError: Expected a positive integer value, but received "0".

[Killed] ConditionalExpression
src/algorithms/sort-radix.ts:16:10
     throw new ExpectedPositiveIntegerError(value);
   }
   let exp = 1;
-  while (10 ** exp <= value) {
+  while (false) {
     exp += 1;
   }
killedBy: getNumberOfDigits returns 2 digits for 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] EqualityOperator
src/algorithms/sort-radix.ts:16:10
     throw new ExpectedPositiveIntegerError(value);
   }
   let exp = 1;
-  while (10 ** exp <= value) {
+  while (10 ** exp < value) {
     exp += 1;
   }
killedBy: getNumberOfDigits returns 2 digits for 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Timeout] AssignmentOperator
src/algorithms/sort-radix.ts:17:5
   }
   let exp = 1;
   while (10 ** exp <= value) {
-    exp += 1;
+    exp -= 1;
   }
   return exp;

[Killed] BlockStatement
src/algorithms/sort-radix.ts:22:65
   return exp;
 };
 
-export const getDigit = (value: number, fromRightIdx: Index) => {
-  if (!Number.isInteger(value) || value < 0) {
-    throw new ExpectedPositiveIntegerError(value);
-  }
-  if (!Number.isInteger(fromRightIdx) || fromRightIdx < 0) {
-    throw new ExpectedPositiveIntegerError(fromRightIdx);
-  }
-  if (10 ** fromRightIdx > value) {
-    return 0;
-  }
-  const str = value.toString();
-  return parseInt(str[str.length - 1 - fromRightIdx]);
-};
+export const getDigit = (value: number, fromRightIdx: Index) => {};
 
 export const radixSort = (
killedBy: getDigit throws an error for non-positive integer input for the value arg
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] BlockStatement
src/algorithms/sort-radix.ts:23:46
 };
 
 export const getDigit = (value: number, fromRightIdx: Index) => {
-  if (!Number.isInteger(value) || value < 0) {
-    throw new ExpectedPositiveIntegerError(value);
-  }
+  if (!Number.isInteger(value) || value < 0) {}
   if (!Number.isInteger(fromRightIdx) || fromRightIdx < 0) {
     throw new ExpectedPositiveIntegerError(fromRightIdx);
killedBy: getDigit throws an error for non-positive integer input for the value arg
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] BooleanLiteral
src/algorithms/sort-radix.ts:23:7
 };
 
 export const getDigit = (value: number, fromRightIdx: Index) => {
-  if (!Number.isInteger(value) || value < 0) {
+  if (Number.isInteger(value) || value < 0) {
     throw new ExpectedPositiveIntegerError(value);
   }
killedBy: getDigit throws an error for non-integer input for the value arg
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/algorithms/sort-radix.ts:26:7
   if (!Number.isInteger(value) || value < 0) {
     throw new ExpectedPositiveIntegerError(value);
   }
-  if (!Number.isInteger(fromRightIdx) || fromRightIdx < 0) {
+  if (false) {
     throw new ExpectedPositiveIntegerError(fromRightIdx);
   }
killedBy: getDigit throws an error for non-positive integer input for the fromRightIdx arg
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/algorithms/sort-radix.ts:26:42
   if (!Number.isInteger(value) || value < 0) {
     throw new ExpectedPositiveIntegerError(value);
   }
-  if (!Number.isInteger(fromRightIdx) || fromRightIdx < 0) {
+  if (!Number.isInteger(fromRightIdx) || false) {
     throw new ExpectedPositiveIntegerError(fromRightIdx);
   }
killedBy: getDigit throws an error for non-positive integer input for the fromRightIdx arg
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/algorithms/sort-radix.ts:29:7
   if (!Number.isInteger(fromRightIdx) || fromRightIdx < 0) {
     throw new ExpectedPositiveIntegerError(fromRightIdx);
   }
-  if (10 ** fromRightIdx > value) {
+  if (false) {
     return 0;
   }
killedBy: getDigit returns 0 as the digit if the value has less digits than the requested digit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: NaN

[Killed] EqualityOperator
src/algorithms/sort-radix.ts:29:7
   if (!Number.isInteger(fromRightIdx) || fromRightIdx < 0) {
     throw new ExpectedPositiveIntegerError(fromRightIdx);
   }
-  if (10 ** fromRightIdx > value) {
+  if (10 ** fromRightIdx <= value) {
     return 0;
   }
killedBy: getDigit returns 1 as the 2nd digit from the right for 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
src/algorithms/sort-radix.ts:33:23
     return 0;
   }
   const str = value.toString();
-  return parseInt(str[str.length - 1 - fromRightIdx]);
+  return parseInt(str[str.length - 1 + fromRightIdx]);
 };
 
killedBy: getDigit returns 1 as the 2nd digit from the right for 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: NaN

[Killed] ArithmeticOperator
src/algorithms/sort-radix.ts:33:23
     return 0;
   }
   const str = value.toString();
-  return parseInt(str[str.length - 1 - fromRightIdx]);
+  return parseInt(str[str.length + 1 - fromRightIdx]);
 };
 
killedBy: getDigit returns 0 as the 1st digit from the right for 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: NaN

[Killed] BlockStatement
src/algorithms/sort-radix.ts:42:37
 ): void => {
   // find the maximum number of digits
   let max = 0;
-  for (const element of collection) {
-    // Stryker disable next-line EqualityOperator: not essential, little difference between < and <=
-    if (max < element) {
-      max = element;
-    }
-  }
+  for (const element of collection) {}
   const maxNumberOfDigits = getNumberOfDigits(max);
 
killedBy: radix sort successfully sorts a large array containing only unique elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/algorithms/sort-radix.ts:44:9
   let max = 0;
   for (const element of collection) {
     // Stryker disable next-line EqualityOperator: not essential, little difference between < and <=
-    if (max < element) {
+    if (true) {
       max = element;
     }
killedBy: radix sort (specific) uses the correct max number of digits
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   3000,
    1,

[Killed] BlockStatement
src/algorithms/sort-radix.ts:44:24
   let max = 0;
   for (const element of collection) {
     // Stryker disable next-line EqualityOperator: not essential, little difference between < and <=
-    if (max < element) {
-      max = element;
-    }
+    if (max < element) {}
   }
   const maxNumberOfDigits = getNumberOfDigits(max);
killedBy: radix sort successfully sorts a large array containing only unique elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/algorithms/sort-radix.ts:51:47
   const maxNumberOfDigits = getNumberOfDigits(max);
 
   // Stryker disable next-line EqualityOperator: not essential, 0 is prepended if using <=
-  for (let i = 0; i < maxNumberOfDigits; i++) {
-    const bins = Array.from({ length: 10 }, () => {
-      return new Array<number>();
-    });
-
-    for (const element of collection) {
-      const digit = getDigit(element, i);
-      bins[digit].push(element);
-    }
-    // flatten the bins array and copy it to the result array prior to the next
-    // loop
-    const flattened = bins.flat();
-    for (let j = 0; j < collection.length; j++) {
-      copyToFunction(flattened, collection, j, j);
-    }
-  }
+  for (let i = 0; i < maxNumberOfDigits; i++) {}
 };
 
killedBy: radix sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [8215, 1028]

[Killed] ConditionalExpression
src/algorithms/sort-radix.ts:51:19
   const maxNumberOfDigits = getNumberOfDigits(max);
 
   // Stryker disable next-line EqualityOperator: not essential, 0 is prepended if using <=
-  for (let i = 0; i < maxNumberOfDigits; i++) {
+  for (let i = 0; false; i++) {
     const bins = Array.from({ length: 10 }, () => {
       return new Array<number>();
killedBy: radix sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [1919, 900]

[Killed] BlockStatement
src/algorithms/sort-radix.ts:52:51
 
   // Stryker disable next-line EqualityOperator: not essential, 0 is prepended if using <=
   for (let i = 0; i < maxNumberOfDigits; i++) {
-    const bins = Array.from({ length: 10 }, () => {
-      return new Array<number>();
-    });
+    const bins = Array.from({ length: 10 }, () => {});
 
     for (const element of collection) {
killedBy: radix sort does nothing when called on an array with 1 element
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] ObjectLiteral
src/algorithms/sort-radix.ts:52:29
 
   // Stryker disable next-line EqualityOperator: not essential, 0 is prepended if using <=
   for (let i = 0; i < maxNumberOfDigits; i++) {
-    const bins = Array.from({ length: 10 }, () => {
+    const bins = Array.from({}, () => {
       return new Array<number>();
     });
killedBy: radix sort does nothing when called on an array with 1 element
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/algorithms/sort-radix.ts:56:39
       return new Array<number>();
     });
 
-    for (const element of collection) {
-      const digit = getDigit(element, i);
-      bins[digit].push(element);
-    }
+    for (const element of collection) {}
     // flatten the bins array and copy it to the result array prior to the next
     // loop
killedBy: radix sort does nothing when called on an array with 1 element
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   0,
+   undefined,

[Killed] BlockStatement
src/algorithms/sort-radix.ts:63:49
     // flatten the bins array and copy it to the result array prior to the next
     // loop
     const flattened = bins.flat();
-    for (let j = 0; j < collection.length; j++) {
-      copyToFunction(flattened, collection, j, j);
-    }
+    for (let j = 0; j < collection.length; j++) {}
   }
 };
killedBy: radix sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [8535, 7155]

[Killed] ConditionalExpression
src/algorithms/sort-radix.ts:63:21
     // flatten the bins array and copy it to the result array prior to the next
     // loop
     const flattened = bins.flat();
-    for (let j = 0; j < collection.length; j++) {
+    for (let j = 0; false; j++) {
       copyToFunction(flattened, collection, j, j);
     }
killedBy: radix sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [1827, 1268]
