[Killed] BooleanLiteral
src/data-structures/binary-search-tree.ts:22:22
 
     // Stryker disable next-line ArrayDeclaration: caught as TypeError
     const array = new Array<T>();
-    let allDefined = true;
+    let allDefined = false;
     BinaryTree.inOrderTraversal<T>((node) => {
       if (!isDefinedAndNotNaN(node.data)) {
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isValidBinarySearchTree === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/data-structures/binary-search-tree.ts:23:46
     // Stryker disable next-line ArrayDeclaration: caught as TypeError
     const array = new Array<T>();
     let allDefined = true;
-    BinaryTree.inOrderTraversal<T>((node) => {
-      if (!isDefinedAndNotNaN(node.data)) {
-        allDefined = false;
-        return;
-      }
-      array.push(node.data);
-    }, this.root);
+    BinaryTree.inOrderTraversal<T>((node) => {}, this.root);
 
     if (!allDefined) {
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isValidBinarySearchTree === false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/data-structures/binary-search-tree.ts:24:43
     const array = new Array<T>();
     let allDefined = true;
     BinaryTree.inOrderTraversal<T>((node) => {
-      if (!isDefinedAndNotNaN(node.data)) {
-        allDefined = false;
-        return;
-      }
+      if (!isDefinedAndNotNaN(node.data)) {}
       array.push(node.data);
     }, this.root);
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isValidBinarySearchTree === false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/data-structures/binary-search-tree.ts:24:11
     const array = new Array<T>();
     let allDefined = true;
     BinaryTree.inOrderTraversal<T>((node) => {
-      if (!isDefinedAndNotNaN(node.data)) {
+      if (true) {
         allDefined = false;
         return;
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isValidBinarySearchTree === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/data-structures/binary-search-tree.ts:25:22
     let allDefined = true;
     BinaryTree.inOrderTraversal<T>((node) => {
       if (!isDefinedAndNotNaN(node.data)) {
-        allDefined = false;
+        allDefined = true;
         return;
       }
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isValidBinarySearchTree === false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/data-structures/binary-search-tree.ts:31:22
       array.push(node.data);
     }, this.root);
 
-    if (!allDefined) {
-      return false;
-    }
+    if (!allDefined) {}
 
     return isSorted(array);
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isValidBinarySearchTree === false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/data-structures/binary-search-tree.ts:31:9
       array.push(node.data);
     }, this.root);
 
-    if (!allDefined) {
+    if (true) {
       return false;
     }
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isValidBinarySearchTree === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/data-structures/binary-search-tree.ts:32:14
     }, this.root);
 
     if (!allDefined) {
-      return false;
+      return true;
     }
 
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isValidBinarySearchTree === false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/data-structures/binary-search-tree.ts:38:28
     return isSorted(array);
   }
 
-  hasDuplicates(): boolean {
-    // Will maintain a reference to the previous node value during an in-order
-    // traversal and check that no two neighboring items are the same
-    let previousNodeValue: T | null = null;
-    let allUnique = true;
-    BinaryTree.inOrderTraversal<T>((node) => {
-      if (node.data === previousNodeValue) {
-        allUnique = false;
-        return;
-      }
-      previousNodeValue = node.data;
-    }, this.root);
-
-    if (!allUnique) {
-      return true;
-    }
-
-    return false;
-  }
+  hasDuplicates(): boolean {}
 
   isComplete(): boolean {
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns hasDuplicates === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
src/data-structures/binary-search-tree.ts:42:21
     // Will maintain a reference to the previous node value during an in-order
     // traversal and check that no two neighboring items are the same
     let previousNodeValue: T | null = null;
-    let allUnique = true;
+    let allUnique = false;
     BinaryTree.inOrderTraversal<T>((node) => {
       if (node.data === previousNodeValue) {
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns hasDuplicates === false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/data-structures/binary-search-tree.ts:43:46
     // traversal and check that no two neighboring items are the same
     let previousNodeValue: T | null = null;
     let allUnique = true;
-    BinaryTree.inOrderTraversal<T>((node) => {
-      if (node.data === previousNodeValue) {
-        allUnique = false;
-        return;
-      }
-      previousNodeValue = node.data;
-    }, this.root);
+    BinaryTree.inOrderTraversal<T>((node) => {}, this.root);
 
     if (!allUnique) {
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns hasDuplicates === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/data-structures/binary-search-tree.ts:44:11
     let previousNodeValue: T | null = null;
     let allUnique = true;
     BinaryTree.inOrderTraversal<T>((node) => {
-      if (node.data === previousNodeValue) {
+      if (node.data !== previousNodeValue) {
         allUnique = false;
         return;
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns hasDuplicates === false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/data-structures/binary-search-tree.ts:44:11
     let previousNodeValue: T | null = null;
     let allUnique = true;
     BinaryTree.inOrderTraversal<T>((node) => {
-      if (node.data === previousNodeValue) {
+      if (false) {
         allUnique = false;
         return;
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns hasDuplicates === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/data-structures/binary-search-tree.ts:45:21
     let allUnique = true;
     BinaryTree.inOrderTraversal<T>((node) => {
       if (node.data === previousNodeValue) {
-        allUnique = false;
+        allUnique = true;
         return;
       }
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns hasDuplicates === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/data-structures/binary-search-tree.ts:51:9
       previousNodeValue = node.data;
     }, this.root);
 
-    if (!allUnique) {
+    if (allUnique) {
       return true;
     }
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns hasDuplicates === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/data-structures/binary-search-tree.ts:51:9
       previousNodeValue = node.data;
     }, this.root);
 
-    if (!allUnique) {
+    if (false) {
       return true;
     }
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns hasDuplicates === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/data-structures/binary-search-tree.ts:52:14
     }, this.root);
 
     if (!allUnique) {
-      return true;
+      return false;
     }
 
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns hasDuplicates === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/data-structures/binary-search-tree.ts:58:25
     return false;
   }
 
-  isComplete(): boolean {
-    return this.#isCompleteInternal(
-      this.root,
-      0,
-      BinaryTree.countNodes<T>(this.root),
-    );
-  }
+  isComplete(): boolean {}
 
   #isCompleteInternal(
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isComplete === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
src/data-structures/binary-search-tree.ts:70:14
     node: BinaryTreeNode<T> | undefined,
     index: number,
     totalNodes: number,
-  ): boolean {
-    if (node === undefined) {
-      // base case: an empty tree is complete
-      return true;
-    }
-
-    if (index >= totalNodes) {
-      // a property of a complete tree is that when all nodes have indices
-      // assigned using 2n+1 (left) and 2n+2 (right), each node's index will be
-      // less than the total number of nodes in the tree
-      return false;
-    }
-
-    return (
-      // Stryker disable next-line ArithmeticOperator: mutant does not survive
-      this.#isCompleteInternal(node.left, 2 * index + 1, totalNodes) &&
-      this.#isCompleteInternal(node.right, 2 * index + 2, totalNodes)
-    );
-  }
+  ): boolean {}
 
   isFull(): boolean {
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isComplete === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/data-structures/binary-search-tree.ts:71:9
     index: number,
     totalNodes: number,
   ): boolean {
-    if (node === undefined) {
+    if (false) {
       // base case: an empty tree is complete
       return true;
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isComplete === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/data-structures/binary-search-tree.ts:71:9
     index: number,
     totalNodes: number,
   ): boolean {
-    if (node === undefined) {
+    if (true) {
       // base case: an empty tree is complete
       return true;
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isComplete === false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/data-structures/binary-search-tree.ts:73:14
   ): boolean {
     if (node === undefined) {
       // base case: an empty tree is complete
-      return true;
+      return false;
     }
 
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isComplete === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/data-structures/binary-search-tree.ts:76:9
       return true;
     }
 
-    if (index >= totalNodes) {
+    if (false) {
       // a property of a complete tree is that when all nodes have indices
       // assigned using 2n+1 (left) and 2n+2 (right), each node's index will be
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isComplete === false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/data-structures/binary-search-tree.ts:76:9
       return true;
     }
 
-    if (index >= totalNodes) {
+    if (true) {
       // a property of a complete tree is that when all nodes have indices
       // assigned using 2n+1 (left) and 2n+2 (right), each node's index will be
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isComplete === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/data-structures/binary-search-tree.ts:80:14
       // a property of a complete tree is that when all nodes have indices
       // assigned using 2n+1 (left) and 2n+2 (right), each node's index will be
       // less than the total number of nodes in the tree
-      return false;
+      return true;
     }
 
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isComplete === false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/data-structures/binary-search-tree.ts:85:7
 
     return (
       // Stryker disable next-line ArithmeticOperator: mutant does not survive
-      this.#isCompleteInternal(node.left, 2 * index + 1, totalNodes) &&
-      this.#isCompleteInternal(node.right, 2 * index + 2, totalNodes)
+      false
     );
   }
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isComplete === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/data-structures/binary-search-tree.ts:85:7
 
     return (
       // Stryker disable next-line ArithmeticOperator: mutant does not survive
-      this.#isCompleteInternal(node.left, 2 * index + 1, totalNodes) &&
-      this.#isCompleteInternal(node.right, 2 * index + 2, totalNodes)
+      true
     );
   }
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isComplete === false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/data-structures/binary-search-tree.ts:86:44
     return (
       // Stryker disable next-line ArithmeticOperator: mutant does not survive
       this.#isCompleteInternal(node.left, 2 * index + 1, totalNodes) &&
-      this.#isCompleteInternal(node.right, 2 * index + 2, totalNodes)
+      this.#isCompleteInternal(node.right, 2 * index - 2, totalNodes)
     );
   }
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isComplete === false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/data-structures/binary-search-tree.ts:86:44
     return (
       // Stryker disable next-line ArithmeticOperator: mutant does not survive
       this.#isCompleteInternal(node.left, 2 * index + 1, totalNodes) &&
-      this.#isCompleteInternal(node.right, 2 * index + 2, totalNodes)
+      this.#isCompleteInternal(node.right, 2 / index + 2, totalNodes)
     );
   }
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isComplete === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/data-structures/binary-search-tree.ts:90:21
     );
   }
 
-  isFull(): boolean {
-    // in a full binary tree, all nodes have either zero or two children
-    return this.#isFullInternal(this.root);
-  }
+  isFull(): boolean {}
 
   #isFullInternal(node?: BinaryTreeNode<T>): boolean {
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isFull === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
src/data-structures/binary-search-tree.ts:95:54
     return this.#isFullInternal(this.root);
   }
 
-  #isFullInternal(node?: BinaryTreeNode<T>): boolean {
-    // perform an in-order traversal, returning false if any node has only one child
-    if (node === undefined) {
-      return true;
-    }
-    if (
-      (node.left !== undefined && node.right === undefined) ||
-      (node.right !== undefined && node.left === undefined)
-    ) {
-      return false;
-    }
-    return this.#isFullInternal(node.left) && this.#isFullInternal(node.right);
-  }
+  #isFullInternal(node?: BinaryTreeNode<T>): boolean {}
 
   isPerfect(): boolean {
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isFull === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
src/data-structures/binary-search-tree.ts:97:29
 
   #isFullInternal(node?: BinaryTreeNode<T>): boolean {
     // perform an in-order traversal, returning false if any node has only one child
-    if (node === undefined) {
-      return true;
-    }
+    if (node === undefined) {}
     if (
       (node.left !== undefined && node.right === undefined) ||
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isFull === true
statusReason: TypeError: Cannot read properties of undefined (reading 'left')

[Killed] ConditionalExpression
src/data-structures/binary-search-tree.ts:97:9
 
   #isFullInternal(node?: BinaryTreeNode<T>): boolean {
     // perform an in-order traversal, returning false if any node has only one child
-    if (node === undefined) {
+    if (false) {
       return true;
     }
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isFull === true
statusReason: TypeError: Cannot read properties of undefined (reading 'left')

[Killed] BooleanLiteral
src/data-structures/binary-search-tree.ts:98:14
   #isFullInternal(node?: BinaryTreeNode<T>): boolean {
     // perform an in-order traversal, returning false if any node has only one child
     if (node === undefined) {
-      return true;
+      return false;
     }
     if (
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isFull === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/data-structures/binary-search-tree.ts:101:8
       return true;
     }
     if (
-      (node.left !== undefined && node.right === undefined) ||
+      (false) ||
       (node.right !== undefined && node.left === undefined)
     ) {
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isFull === false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/data-structures/binary-search-tree.ts:101:8
       return true;
     }
     if (
-      (node.left !== undefined && node.right === undefined) ||
+      (node.left !== undefined || node.right === undefined) ||
       (node.right !== undefined && node.left === undefined)
     ) {
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isFull === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/data-structures/binary-search-tree.ts:102:8
     }
     if (
       (node.left !== undefined && node.right === undefined) ||
-      (node.right !== undefined && node.left === undefined)
+      (node.right === undefined && node.left === undefined)
     ) {
       return false;
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isFull === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/data-structures/binary-search-tree.ts:102:36
     }
     if (
       (node.left !== undefined && node.right === undefined) ||
-      (node.right !== undefined && node.left === undefined)
+      (node.right !== undefined && true)
     ) {
       return false;
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isFull === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/data-structures/binary-search-tree.ts:103:7
     if (
       (node.left !== undefined && node.right === undefined) ||
       (node.right !== undefined && node.left === undefined)
-    ) {
-      return false;
-    }
+    ) {}
     return this.#isFullInternal(node.left) && this.#isFullInternal(node.right);
   }
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isFull === false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/data-structures/binary-search-tree.ts:106:12
     ) {
       return false;
     }
-    return this.#isFullInternal(node.left) && this.#isFullInternal(node.right);
+    return false;
   }
 
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isFull === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/data-structures/binary-search-tree.ts:106:12
     ) {
       return false;
     }
-    return this.#isFullInternal(node.left) && this.#isFullInternal(node.right);
+    return this.#isFullInternal(node.left) || this.#isFullInternal(node.right);
   }
 
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isFull === false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/data-structures/binary-search-tree.ts:109:24
     return this.#isFullInternal(node.left) && this.#isFullInternal(node.right);
   }
 
-  isPerfect(): boolean {
-    const count = BinaryTree.countNodes<T>(this.root);
-    let maxDepth = 0;
-    BinaryTree.depthAwareInOrderTraversal((_, depth) => {
-      // Stryker disable next-line all: mutants do not survive
-      if (depth > maxDepth) {
-        maxDepth = depth;
-      }
-    }, this.root);
-    return count === Math.pow(2, maxDepth + 1) - 1;
-  }
+  isPerfect(): boolean {}
 
   // Stryker disable all: for debugging, not used in tests and not critical
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isPerfect === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
src/data-structures/binary-search-tree.ts:112:57
   isPerfect(): boolean {
     const count = BinaryTree.countNodes<T>(this.root);
     let maxDepth = 0;
-    BinaryTree.depthAwareInOrderTraversal((_, depth) => {
-      // Stryker disable next-line all: mutants do not survive
-      if (depth > maxDepth) {
-        maxDepth = depth;
-      }
-    }, this.root);
+    BinaryTree.depthAwareInOrderTraversal((_, depth) => {}, this.root);
     return count === Math.pow(2, maxDepth + 1) - 1;
   }
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isPerfect === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/data-structures/binary-search-tree.ts:118:22
         maxDepth = depth;
       }
     }, this.root);
-    return count === Math.pow(2, maxDepth + 1) - 1;
+    return count === Math.pow(2, maxDepth + 1) + 1;
   }
 
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isPerfect === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/data-structures/binary-search-tree.ts:118:12
         maxDepth = depth;
       }
     }, this.root);
-    return count === Math.pow(2, maxDepth + 1) - 1;
+    return count !== Math.pow(2, maxDepth + 1) - 1;
   }
 
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isPerfect === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/data-structures/binary-search-tree.ts:140:5
   static inOrderTraversal<T>(
     visit: (node: BinaryTreeNode<T>) => void,
     node?: BinaryTreeNode<T>,
-  ) {
-    if (node === undefined) {
-      return;
-    }
-    // In-Order: the node's left child, then the node, then the node's right child
-    BinaryTree.inOrderTraversal(visit, node.left);
-    visit(node);
-    BinaryTree.inOrderTraversal(visit, node.right);
-  }
+  ) {}
 
   static preOrderTraversal<T>(
killedBy: traversal in-order traversal given binary tree {"root": [BinaryTreeNode]}, visits nodes in-order and constructs array with length [123] and value %p
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   123,
- ]

[Killed] EqualityOperator
src/data-structures/binary-search-tree.ts:141:9
     visit: (node: BinaryTreeNode<T>) => void,
     node?: BinaryTreeNode<T>,
   ) {
-    if (node === undefined) {
+    if (node !== undefined) {
       return;
     }
killedBy: traversal in-order traversal given binary tree {"root": [BinaryTreeNode]}, visits nodes in-order and constructs array with length [123] and value %p
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   123,
- ]

[Killed] ConditionalExpression
src/data-structures/binary-search-tree.ts:141:9
     visit: (node: BinaryTreeNode<T>) => void,
     node?: BinaryTreeNode<T>,
   ) {
-    if (node === undefined) {
+    if (false) {
       return;
     }
killedBy: traversal in-order traversal given binary tree {"root": [BinaryTreeNode]}, visits nodes in-order and constructs array with length [123] and value %p
statusReason: TypeError: Cannot read properties of undefined (reading 'left')

[Killed] BlockStatement
src/data-structures/binary-search-tree.ts:153:5
   static preOrderTraversal<T>(
     visit: (node: BinaryTreeNode<T>) => void,
     node?: BinaryTreeNode<T>,
-  ) {
-    if (node === undefined) {
-      return;
-    }
-    // Pre-Order: the node, then the node's left child, then the node's right child
-    visit(node);
-    BinaryTree.preOrderTraversal(visit, node.left);
-    BinaryTree.preOrderTraversal(visit, node.right);
-  }
+  ) {}
 
   static postOrderTraversal<T>(
killedBy: traversal pre-order traversal given binary tree {"root": [BinaryTreeNode]}, visits nodes pre-order and constructs array with length [123] and value %p
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   123,
- ]

[Killed] ConditionalExpression
src/data-structures/binary-search-tree.ts:154:9
     visit: (node: BinaryTreeNode<T>) => void,
     node?: BinaryTreeNode<T>,
   ) {
-    if (node === undefined) {
+    if (true) {
       return;
     }
killedBy: traversal pre-order traversal given binary tree {"root": [BinaryTreeNode]}, visits nodes pre-order and constructs array with length [123] and value %p
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   123,
- ]

[Killed] BlockStatement
src/data-structures/binary-search-tree.ts:166:5
   static postOrderTraversal<T>(
     visit: (node: BinaryTreeNode<T>) => void,
     node?: BinaryTreeNode<T>,
-  ) {
-    if (node === undefined) {
-      return;
-    }
-    // Post-Order: the node's left child, then the node's right child, then the node
-    BinaryTree.postOrderTraversal(visit, node.left);
-    BinaryTree.postOrderTraversal(visit, node.right);
-    visit(node);
-  }
+  ) {}
 
   static depthAwareInOrderTraversal<T>(
killedBy: traversal post-order traversal given binary tree {"root": [BinaryTreeNode]}, visits nodes post-order and constructs array with length [123] and value %p
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   123,
- ]

[Killed] BlockStatement
src/data-structures/binary-search-tree.ts:180:5
     visit: (node: BinaryTreeNode<T>, depth: number) => void,
     node?: BinaryTreeNode<T>,
     depth: number = 0,
-  ) {
-    if (node === undefined) {
-      return;
-    }
-    // In-Order: the node's left child, then the node, then the node's right child
-    // Stryker disable all: mutants do not survive
-    BinaryTree.depthAwareInOrderTraversal(visit, node.left, depth + 1);
-    visit(node, depth);
-    BinaryTree.depthAwareInOrderTraversal(visit, node.right, depth + 1);
-    // Stryker restore all
-  }
+  ) {}
 
   static countNodes<T>(node?: BinaryTreeNode<T>): number {
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isPerfect === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
