[Killed] BlockStatement
src/data-structures/binary-search-tree.ts:181:29
     node?: BinaryTreeNode<T>,
     depth: number = 0,
   ) {
-    if (node === undefined) {
-      return;
-    }
+    if (node === undefined) {}
     // In-Order: the node's left child, then the node, then the node's right child
     // Stryker disable all: mutants do not survive
killedBy: tree qualities given binary tree {"root": [BinaryTreeNode]}, returns isPerfect === true
statusReason: TypeError: Cannot read properties of undefined (reading 'left')
