[Killed] BlockStatement
src/data-structures/doubly-linked-list.ts:9:24
   previous?: DoublyLinkedNode<T> | DoublyLinkedRootNode<T>;
   next?: DoublyLinkedNode<T>;
 
-  constructor(data: T) {
-    this.data = data;
-  }
+  constructor(data: T) {}
 }
 
killedBy: doubly linked list linked list nodes can be connected and traversed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
src/data-structures/doubly-linked-list.ts:26:47
 export class DoublyLinkedList<T> implements LinkedList<T> {
   #root?: DoublyLinkedRootNode<T>;
 
-  constructor(root?: DoublyLinkedRootNode<T>) {
-    this.#root = root;
-  }
+  constructor(root?: DoublyLinkedRootNode<T>) {}
 
   insertBeginning(newRoot: DoublyLinkedRootNode<T>) {
killedBy: doubly linked list constructor successfully assigns root node when one is provided
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not 0

[Killed] BlockStatement
src/data-structures/doubly-linked-list.ts:30:53
     this.#root = root;
   }
 
-  insertBeginning(newRoot: DoublyLinkedRootNode<T>) {
-    if (this.#root !== undefined) {
-      const oldRoot = new DoublyLinkedNode<T>(this.#root.data);
-      oldRoot.previous = newRoot;
-      newRoot.next = oldRoot;
-    }
-    this.#root = newRoot;
-  }
+  insertBeginning(newRoot: DoublyLinkedRootNode<T>) {}
 
   insertAfter(node: DoublyLinkedNode<T>, newNode: DoublyLinkedNode<T>) {
killedBy: doubly linked list empty insertBeginning sets newRoot as the root for an empty linked list
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] ConditionalExpression
src/data-structures/doubly-linked-list.ts:31:9
   }
 
   insertBeginning(newRoot: DoublyLinkedRootNode<T>) {
-    if (this.#root !== undefined) {
+    if (true) {
       const oldRoot = new DoublyLinkedNode<T>(this.#root.data);
       oldRoot.previous = newRoot;
killedBy: doubly linked list empty insertBeginning sets newRoot as the root for an empty linked list
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] BlockStatement
src/data-structures/doubly-linked-list.ts:31:35
   }
 
   insertBeginning(newRoot: DoublyLinkedRootNode<T>) {
-    if (this.#root !== undefined) {
-      const oldRoot = new DoublyLinkedNode<T>(this.#root.data);
-      oldRoot.previous = newRoot;
-      newRoot.next = oldRoot;
-    }
+    if (this.#root !== undefined) {}
     this.#root = newRoot;
   }
killedBy: doubly linked list with 3 elements insertBeginning places newRoot in correct position
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] BlockStatement
src/data-structures/doubly-linked-list.ts:39:72
     this.#root = newRoot;
   }
 
-  insertAfter(node: DoublyLinkedNode<T>, newNode: DoublyLinkedNode<T>) {
-    newNode.next = node.next;
-    if (newNode.next !== undefined) {
-      newNode.next.previous = newNode;
-    }
-    node.next = newNode;
-    newNode.previous = node;
-  }
+  insertAfter(node: DoublyLinkedNode<T>, newNode: DoublyLinkedNode<T>) {}
 
   removeBeginning() {
killedBy: doubly linked list with 3 elements insertAfter places newNode in correct position
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6958
Received: 2

[Killed] BlockStatement
src/data-structures/doubly-linked-list.ts:41:37
 
   insertAfter(node: DoublyLinkedNode<T>, newNode: DoublyLinkedNode<T>) {
     newNode.next = node.next;
-    if (newNode.next !== undefined) {
-      newNode.next.previous = newNode;
-    }
+    if (newNode.next !== undefined) {}
     node.next = newNode;
     newNode.previous = node;
killedBy: doubly linked list (specific) constructed with many scattered insertAfter/removeAfter calls is correctly traversed back-to-front
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 997
Received: 996

[Killed] ConditionalExpression
src/data-structures/doubly-linked-list.ts:41:9
 
   insertAfter(node: DoublyLinkedNode<T>, newNode: DoublyLinkedNode<T>) {
     newNode.next = node.next;
-    if (newNode.next !== undefined) {
+    if (true) {
       newNode.next.previous = newNode;
     }
killedBy: doubly linked list (specific) removeAfter sets the previous node of the node following the removed node correctly
statusReason: TypeError: Cannot set properties of undefined (setting 'previous')

[Killed] BlockStatement
src/data-structures/doubly-linked-list.ts:48:21
     newNode.previous = node;
   }
 
-  removeBeginning() {
-    const newRoot = this.#root?.next;
-    deleteObjectProperties(this.#root);
-    this.#root = newRoot;
-  }
+  removeBeginning() {}
 
   removeAfter(node: DoublyLinkedNode<T>) {
killedBy: doubly linked list with 1 element removeBeginning deletes the root node's properties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] OptionalChaining
src/data-structures/doubly-linked-list.ts:49:21
   }
 
   removeBeginning() {
-    const newRoot = this.#root?.next;
+    const newRoot = this.#root.next;
     deleteObjectProperties(this.#root);
     this.#root = newRoot;
killedBy: doubly linked list empty removeBeginning does nothing for an empty linked list
statusReason: TypeError: Cannot read properties of undefined (reading 'next')

[Killed] BlockStatement
src/data-structures/doubly-linked-list.ts:54:42
     this.#root = newRoot;
   }
 
-  removeAfter(node: DoublyLinkedNode<T>) {
-    if (node.next === undefined) {
-      return;
-    }
-    const newNextNode = node.next.next;
-    deleteObjectProperties(node.next);
-    node.next = newNextNode;
-    // Stryker disable next-line ConditionalExpression: caught as a TypeError
-    if (newNextNode !== undefined) {
-      newNextNode.previous = node;
-    }
-  }
+  removeAfter(node: DoublyLinkedNode<T>) {}
 
   get root() {
killedBy: doubly linked list with 3 elements length is reduced by 1 after calling removeAfter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] ConditionalExpression
src/data-structures/doubly-linked-list.ts:55:9
   }
 
   removeAfter(node: DoublyLinkedNode<T>) {
-    if (node.next === undefined) {
+    if (true) {
       return;
     }
killedBy: doubly linked list with 3 elements length is reduced by 1 after calling removeAfter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] EqualityOperator
src/data-structures/doubly-linked-list.ts:55:9
   }
 
   removeAfter(node: DoublyLinkedNode<T>) {
-    if (node.next === undefined) {
+    if (node.next !== undefined) {
       return;
     }
killedBy: doubly linked list with 1 element removeAfter does nothing
statusReason: TypeError: Cannot read properties of undefined (reading 'next')

[Killed] EqualityOperator
src/data-structures/doubly-linked-list.ts:62:9
     deleteObjectProperties(node.next);
     node.next = newNextNode;
     // Stryker disable next-line ConditionalExpression: caught as a TypeError
-    if (newNextNode !== undefined) {
+    if (newNextNode === undefined) {
       newNextNode.previous = node;
     }
killedBy: doubly linked list (specific) removeAfter sets the previous node of the node following the removed node correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 36
+ Received  +  1

- DoublyLinkedNode {
-   "data": 5,
-   "next": DoublyLinkedNode {

[Killed] BlockStatement
src/data-structures/doubly-linked-list.ts:62:36
     deleteObjectProperties(node.next);
     node.next = newNextNode;
     // Stryker disable next-line ConditionalExpression: caught as a TypeError
-    if (newNextNode !== undefined) {
-      newNextNode.previous = node;
-    }
+    if (newNextNode !== undefined) {}
   }
 
killedBy: doubly linked list (specific) removeAfter sets the previous node of the node following the removed node correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 36
+ Received  +  1

- DoublyLinkedNode {
-   "data": 3,
-   "next": DoublyLinkedNode {

[Killed] BlockStatement
src/data-structures/doubly-linked-list.ts:67:14
     }
   }
 
-  get root() {
-    return this.#root;
-  }
+  get root() {}
 
   get length() {
killedBy: doubly linked list constructor successfully assigns root node when one is provided
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not 0

[Killed] BlockStatement
src/data-structures/doubly-linked-list.ts:71:16
     return this.#root;
   }
 
-  get length() {
-    let count = 0;
-    let current = this.root;
-    while (current !== undefined) {
-      count += 1;
-      current = current.next;
-    }
-    return count;
-  }
+  get length() {}
 
   [Symbol.iterator](): Iterator<DoublyLinkedNode<T>> {
killedBy: doubly linked list default constructor does not assign a root
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] EqualityOperator
src/data-structures/doubly-linked-list.ts:74:12
   get length() {
     let count = 0;
     let current = this.root;
-    while (current !== undefined) {
+    while (current === undefined) {
       count += 1;
       current = current.next;
killedBy: doubly linked list default constructor does not assign a root
statusReason: TypeError: Cannot read properties of undefined (reading 'next')

[Killed] ConditionalExpression
src/data-structures/doubly-linked-list.ts:74:12
   get length() {
     let count = 0;
     let current = this.root;
-    while (current !== undefined) {
+    while (false) {
       count += 1;
       current = current.next;
killedBy: doubly linked list constructor successfully assigns root node when one is provided
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not 0

[Killed] AssignmentOperator
src/data-structures/doubly-linked-list.ts:75:7
     let count = 0;
     let current = this.root;
     while (current !== undefined) {
-      count += 1;
+      count -= 1;
       current = current.next;
     }
killedBy: doubly linked list constructor successfully assigns root node when one is provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] BlockStatement
src/data-structures/doubly-linked-list.ts:81:54
     return count;
   }
 
-  [Symbol.iterator](): Iterator<DoublyLinkedNode<T>> {
-    let current = this.root;
-    return {
-      next() {
-        if (current === undefined) {
-          return { value: undefined, done: true };
-        }
-        const result = { value: current, done: false };
-        current = current.next;
-        return result;
-      },
-    };
-  }
+  [Symbol.iterator](): Iterator<DoublyLinkedNode<T>> {}
 }
 
killedBy: doubly linked list empty empty linked list is not iterable
statusReason: TypeError: Result of the Symbol.iterator method is not an object

[Killed] BlockStatement
src/data-structures/doubly-linked-list.ts:84:14
   [Symbol.iterator](): Iterator<DoublyLinkedNode<T>> {
     let current = this.root;
     return {
-      next() {
-        if (current === undefined) {
-          return { value: undefined, done: true };
-        }
-        const result = { value: current, done: false };
-        current = current.next;
-        return result;
-      },
+      next() {},
     };
   }
killedBy: doubly linked list empty empty linked list is not iterable
statusReason: TypeError: Iterator result undefined is not an object

[Killed] BlockStatement
src/data-structures/doubly-linked-list.ts:85:36
     let current = this.root;
     return {
       next() {
-        if (current === undefined) {
-          return { value: undefined, done: true };
-        }
+        if (current === undefined) {}
         const result = { value: current, done: false };
         current = current.next;
killedBy: doubly linked list empty empty linked list is not iterable
statusReason: TypeError: Cannot read properties of undefined (reading 'next')

[Killed] ConditionalExpression
src/data-structures/doubly-linked-list.ts:85:13
     let current = this.root;
     return {
       next() {
-        if (current === undefined) {
+        if (true) {
           return { value: undefined, done: true };
         }
killedBy: doubly linked list with many elements can iterate through list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   999,
-   998,

[Timeout] BooleanLiteral
src/data-structures/doubly-linked-list.ts:86:44
     return {
       next() {
         if (current === undefined) {
-          return { value: undefined, done: true };
+          return { value: undefined, done: false };
         }
         const result = { value: current, done: false };

[Timeout] ObjectLiteral
src/data-structures/doubly-linked-list.ts:86:18
     return {
       next() {
         if (current === undefined) {
-          return { value: undefined, done: true };
+          return {};
         }
         const result = { value: current, done: false };

[Killed] BooleanLiteral
src/data-structures/doubly-linked-list.ts:88:48
         if (current === undefined) {
           return { value: undefined, done: true };
         }
-        const result = { value: current, done: false };
+        const result = { value: current, done: true };
         current = current.next;
         return result;
killedBy: doubly linked list with many elements can iterate through list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   999,
-   998,
