[Killed] BlockStatement
src/data-structures/hash-table.ts:10:50
 
 // JavaScript implementation of Java string hash function
 // Source: https://stackoverflow.com/a/8831937
-export const hash = (item: StringConvertible) => {
-  const str = item.toString();
-  let hash = 0;
-  for (let i = 0, len = str.length; i < len; i++) {
-    const charCode = str.charCodeAt(i);
-    // Bitwise left shift
-    // Stryker disable next-line ArithmeticOperator: hashing algorithm detail, not critical
-    hash = (hash << 5) - hash + charCode;
-    // Convert to 32bit integer using bitwise OR assignment
-    hash |= 0;
-  }
-  return hash;
-};
+export const hash = (item: StringConvertible) => {};
 
 /* Hash Table: data structure which stores key-value pairs using a hash
killedBy: hash table hash function generates a unique hash across simple inputs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/data-structures/hash-table.ts:13:37
 export const hash = (item: StringConvertible) => {
   const str = item.toString();
   let hash = 0;
-  for (let i = 0, len = str.length; i < len; i++) {
+  for (let i = 0, len = str.length; false; i++) {
     const charCode = str.charCodeAt(i);
     // Bitwise left shift
killedBy: hash table hash function generates a unique hash across simple inputs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/data-structures/hash-table.ts:13:51
 export const hash = (item: StringConvertible) => {
   const str = item.toString();
   let hash = 0;
-  for (let i = 0, len = str.length; i < len; i++) {
-    const charCode = str.charCodeAt(i);
-    // Bitwise left shift
-    // Stryker disable next-line ArithmeticOperator: hashing algorithm detail, not critical
-    hash = (hash << 5) - hash + charCode;
-    // Convert to 32bit integer using bitwise OR assignment
-    hash |= 0;
-  }
+  for (let i = 0, len = str.length; i < len; i++) {}
   return hash;
 };
killedBy: hash table hash function generates a unique hash across simple inputs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] AssignmentOperator
src/data-structures/hash-table.ts:19:5
     // Stryker disable next-line ArithmeticOperator: hashing algorithm detail, not critical
     hash = (hash << 5) - hash + charCode;
     // Convert to 32bit integer using bitwise OR assignment
-    hash |= 0;
+    hash &= 0;
   }
   return hash;
killedBy: hash table hash function generates a unique hash across simple inputs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/data-structures/hash-table.ts:34:5
   constructor(
     size: number,
     initialKeyValuePairs?: Iterable<[KeyType, ValueType]>,
-  ) {
-    this.#size = size;
-    // Stryker disable next-line ArrayDeclaration: optimization
-    this.#array = new Array<SinglyLinkedList<[KeyType, ValueType]>>(size);
-    if (initialKeyValuePairs === undefined) {
-      return;
-    }
-    for (const pair of initialKeyValuePairs) {
-      this.set(pair[0], pair[1]);
-    }
-  }
+  ) {}
 
   get(key: KeyType) {
killedBy: hash table defaults by default allows overwrites for the set method
statusReason: TypeError: Cannot read properties of undefined (reading 'NaN')

[Killed] ConditionalExpression
src/data-structures/hash-table.ts:38:9
     this.#size = size;
     // Stryker disable next-line ArrayDeclaration: optimization
     this.#array = new Array<SinglyLinkedList<[KeyType, ValueType]>>(size);
-    if (initialKeyValuePairs === undefined) {
+    if (true) {
       return;
     }
killedBy: hash table should store the initial set of key/value pairs when provided to the constructor
statusReason: KeyNotFoundError: Key not found: "0".

[Killed] ConditionalExpression
src/data-structures/hash-table.ts:38:9
     this.#size = size;
     // Stryker disable next-line ArrayDeclaration: optimization
     this.#array = new Array<SinglyLinkedList<[KeyType, ValueType]>>(size);
-    if (initialKeyValuePairs === undefined) {
+    if (false) {
       return;
     }
killedBy: hash table defaults by default allows overwrites for the set method
statusReason: TypeError: initialKeyValuePairs is not iterable

[Killed] BlockStatement
src/data-structures/hash-table.ts:41:46
     if (initialKeyValuePairs === undefined) {
       return;
     }
-    for (const pair of initialKeyValuePairs) {
-      this.set(pair[0], pair[1]);
-    }
+    for (const pair of initialKeyValuePairs) {}
   }
 
killedBy: hash table should store the initial set of key/value pairs when provided to the constructor
statusReason: KeyNotFoundError: Key not found: "0".

[Killed] BlockStatement
src/data-structures/hash-table.ts:46:21
     }
   }
 
-  get(key: KeyType) {
-    const index = hash(key) % this.#size;
-    const list = this.#array[index];
-    if (list === undefined) {
-      throw new KeyNotFoundError(key);
-    }
-    for (let node = list.root; node !== undefined; node = node.next) {
-      if (node.data[0] === key) {
-        return node.data[1];
-      }
-    }
-    throw new KeyNotFoundError(key);
-  }
+  get(key: KeyType) {}
 
   set(key: KeyType, value: ValueType, allowOverwrite = true) {
killedBy: hash table defaults by default allows overwrites for the set method
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ArithmeticOperator
src/data-structures/hash-table.ts:47:19
   }
 
   get(key: KeyType) {
-    const index = hash(key) % this.#size;
+    const index = hash(key) * this.#size;
     const list = this.#array[index];
     if (list === undefined) {
killedBy: hash table defaults by default allows overwrites for the set method
statusReason: KeyNotFoundError: Key not found: "hello".

[Killed] ConditionalExpression
src/data-structures/hash-table.ts:49:9
   get(key: KeyType) {
     const index = hash(key) % this.#size;
     const list = this.#array[index];
-    if (list === undefined) {
+    if (false) {
       throw new KeyNotFoundError(key);
     }
killedBy: hash table get should throw a KeyNotFoundError when called on a key that does not exist in the table
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: KeyNotFoundError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'root')"

      125 |         }

[Killed] EqualityOperator
src/data-structures/hash-table.ts:49:9
   get(key: KeyType) {
     const index = hash(key) % this.#size;
     const list = this.#array[index];
-    if (list === undefined) {
+    if (list !== undefined) {
       throw new KeyNotFoundError(key);
     }
killedBy: hash table defaults by default allows overwrites for the set method
statusReason: KeyNotFoundError: Key not found: "hello".

[Killed] BlockStatement
src/data-structures/hash-table.ts:52:70
     if (list === undefined) {
       throw new KeyNotFoundError(key);
     }
-    for (let node = list.root; node !== undefined; node = node.next) {
-      if (node.data[0] === key) {
-        return node.data[1];
-      }
-    }
+    for (let node = list.root; node !== undefined; node = node.next) {}
     throw new KeyNotFoundError(key);
   }
killedBy: hash table defaults by default allows overwrites for the set method
statusReason: KeyNotFoundError: Key not found: "hello".

[Killed] EqualityOperator
src/data-structures/hash-table.ts:52:32
     if (list === undefined) {
       throw new KeyNotFoundError(key);
     }
-    for (let node = list.root; node !== undefined; node = node.next) {
+    for (let node = list.root; node === undefined; node = node.next) {
       if (node.data[0] === key) {
         return node.data[1];
killedBy: hash table defaults by default allows overwrites for the set method
statusReason: KeyNotFoundError: Key not found: "hello".

[Killed] ConditionalExpression
src/data-structures/hash-table.ts:53:11
       throw new KeyNotFoundError(key);
     }
     for (let node = list.root; node !== undefined; node = node.next) {
-      if (node.data[0] === key) {
+      if (true) {
         return node.data[1];
       }
killedBy: hash table delete should not alter the table if the key is not found, even when the key collides with existing keys
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 98

[Killed] ConditionalExpression
src/data-structures/hash-table.ts:53:11
       throw new KeyNotFoundError(key);
     }
     for (let node = list.root; node !== undefined; node = node.next) {
-      if (node.data[0] === key) {
+      if (false) {
         return node.data[1];
       }
killedBy: hash table defaults by default allows overwrites for the set method
statusReason: KeyNotFoundError: Key not found: "hello".

[Killed] BlockStatement
src/data-structures/hash-table.ts:60:62
     throw new KeyNotFoundError(key);
   }
 
-  set(key: KeyType, value: ValueType, allowOverwrite = true) {
-    const index = hash(key) % this.#size;
-    if (this.#array[index] === undefined) {
-      this.#array[index] = new SinglyLinkedList<[KeyType, ValueType]>();
-    }
-    const list = this.#array[index];
-    // check if the list already includes the key being stored and overwrite
-    // the value if so
-    for (let node = list.root; node !== undefined; node = node.next) {
-      if (node.data[0] === key) {
-        if (!allowOverwrite) {
-          return;
-        }
-        node.data[1] = value;
-        return;
-      }
-    }
-    list.insertBeginning(new SinglyLinkedNode([key, value]));
-  }
+  set(key: KeyType, value: ValueType, allowOverwrite = true) {}
 
   delete(key: KeyType, throwIfNotFound = true) {
killedBy: hash table defaults by default allows overwrites for the set method
statusReason: KeyNotFoundError: Key not found: "hello".

[Killed] BooleanLiteral
src/data-structures/hash-table.ts:60:56
     throw new KeyNotFoundError(key);
   }
 
-  set(key: KeyType, value: ValueType, allowOverwrite = true) {
+  set(key: KeyType, value: ValueType, allowOverwrite = false) {
     const index = hash(key) % this.#size;
     if (this.#array[index] === undefined) {
killedBy: hash table defaults by default allows overwrites for the set method
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ArithmeticOperator
src/data-structures/hash-table.ts:61:19
   }
 
   set(key: KeyType, value: ValueType, allowOverwrite = true) {
-    const index = hash(key) % this.#size;
+    const index = hash(key) * this.#size;
     if (this.#array[index] === undefined) {
       this.#array[index] = new SinglyLinkedList<[KeyType, ValueType]>();
killedBy: hash table defaults by default allows overwrites for the set method
statusReason: KeyNotFoundError: Key not found: "hello".

[Killed] ConditionalExpression
src/data-structures/hash-table.ts:62:9
 
   set(key: KeyType, value: ValueType, allowOverwrite = true) {
     const index = hash(key) % this.#size;
-    if (this.#array[index] === undefined) {
+    if (true) {
       this.#array[index] = new SinglyLinkedList<[KeyType, ValueType]>();
     }
killedBy: hash table set should not overwrite values if prohibited from doing so
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: -987

[Killed] EqualityOperator
src/data-structures/hash-table.ts:62:9
 
   set(key: KeyType, value: ValueType, allowOverwrite = true) {
     const index = hash(key) % this.#size;
-    if (this.#array[index] === undefined) {
+    if (this.#array[index] !== undefined) {
       this.#array[index] = new SinglyLinkedList<[KeyType, ValueType]>();
     }
killedBy: hash table defaults by default allows overwrites for the set method
statusReason: TypeError: Cannot read properties of undefined (reading 'root')

[Killed] BlockStatement
src/data-structures/hash-table.ts:68:70
     const list = this.#array[index];
     // check if the list already includes the key being stored and overwrite
     // the value if so
-    for (let node = list.root; node !== undefined; node = node.next) {
-      if (node.data[0] === key) {
-        if (!allowOverwrite) {
-          return;
-        }
-        node.data[1] = value;
-        return;
-      }
-    }
+    for (let node = list.root; node !== undefined; node = node.next) {}
     list.insertBeginning(new SinglyLinkedNode([key, value]));
   }
killedBy: hash table set should not overwrite values if prohibited from doing so
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: -987

[Killed] ConditionalExpression
src/data-structures/hash-table.ts:68:32
     const list = this.#array[index];
     // check if the list already includes the key being stored and overwrite
     // the value if so
-    for (let node = list.root; node !== undefined; node = node.next) {
+    for (let node = list.root; false; node = node.next) {
       if (node.data[0] === key) {
         if (!allowOverwrite) {
killedBy: hash table set should not overwrite values if prohibited from doing so
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: -987

[Killed] ConditionalExpression
src/data-structures/hash-table.ts:70:13
     // the value if so
     for (let node = list.root; node !== undefined; node = node.next) {
       if (node.data[0] === key) {
-        if (!allowOverwrite) {
+        if (false) {
           return;
         }
killedBy: hash table set should not overwrite values if prohibited from doing so
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: -987

[Killed] BooleanLiteral
src/data-structures/hash-table.ts:70:13
     // the value if so
     for (let node = list.root; node !== undefined; node = node.next) {
       if (node.data[0] === key) {
-        if (!allowOverwrite) {
+        if (allowOverwrite) {
           return;
         }
killedBy: hash table defaults by default allows overwrites for the set method
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BooleanLiteral
src/data-structures/hash-table.ts:80:42
     list.insertBeginning(new SinglyLinkedNode([key, value]));
   }
 
-  delete(key: KeyType, throwIfNotFound = true) {
+  delete(key: KeyType, throwIfNotFound = false) {
     const index = hash(key) % this.#size;
     if (this.#array[index] === undefined) {
killedBy: hash table defaults by default throws an error if a key targeted by delete is not found
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: KeyNotFoundError

Received function did not throw

[Killed] ArithmeticOperator
src/data-structures/hash-table.ts:81:19
   }
 
   delete(key: KeyType, throwIfNotFound = true) {
-    const index = hash(key) % this.#size;
+    const index = hash(key) * this.#size;
     if (this.#array[index] === undefined) {
       if (throwIfNotFound) {
killedBy: hash table delete should successfully delete an entry in the table (no collisions)
statusReason: KeyNotFoundError: Key not found: "b".

[Killed] ConditionalExpression
src/data-structures/hash-table.ts:82:9
 
   delete(key: KeyType, throwIfNotFound = true) {
     const index = hash(key) % this.#size;
-    if (this.#array[index] === undefined) {
+    if (false) {
       if (throwIfNotFound) {
         throw new KeyNotFoundError(key);
killedBy: hash table defaults by default throws an error if a key targeted by delete is not found
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: KeyNotFoundError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'root')"

      213 |       // if so

[Killed] ConditionalExpression
src/data-structures/hash-table.ts:83:11
   delete(key: KeyType, throwIfNotFound = true) {
     const index = hash(key) % this.#size;
     if (this.#array[index] === undefined) {
-      if (throwIfNotFound) {
+      if (true) {
         throw new KeyNotFoundError(key);
       }
killedBy: hash table delete should not throw a KeyNotFoundError when called on an empty table, when specified
statusReason: Error: expect(received).not.toThrow(expected)

Expected constructor: not KeyNotFoundError

Received message: "Key not found: \"something\"."

      203 |             } else {
      204 |               stryCov_9fa48("357");

[Killed] BlockStatement
src/data-structures/hash-table.ts:83:28
   delete(key: KeyType, throwIfNotFound = true) {
     const index = hash(key) % this.#size;
     if (this.#array[index] === undefined) {
-      if (throwIfNotFound) {
-        throw new KeyNotFoundError(key);
-      }
+      if (throwIfNotFound) {}
       return;
     }
killedBy: hash table defaults by default throws an error if a key targeted by delete is not found
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: KeyNotFoundError

Received function did not throw

[Killed] ConditionalExpression
src/data-structures/hash-table.ts:92:9
     // check if the list includes the key being stored and delete the list node
     // if so
     // Stryker disable next-line OptionalChaining: caught as TypeError
-    if (list.root?.data[0] === key) {
+    if (true) {
       list.removeBeginning();
       return;
killedBy: hash table delete should not alter the table if the key is not found, even when the key collides with existing keys
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] EqualityOperator
src/data-structures/hash-table.ts:92:9
     // check if the list includes the key being stored and delete the list node
     // if so
     // Stryker disable next-line OptionalChaining: caught as TypeError
-    if (list.root?.data[0] === key) {
+    if (list.root?.data[0] !== key) {
       list.removeBeginning();
       return;
killedBy: hash table delete should not alter the table if the key is not found, even when the key collides with existing keys
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/data-structures/hash-table.ts:96:32
       list.removeBeginning();
       return;
     }
-    for (let node = list.root; node !== undefined; ) {
+    for (let node = list.root; false; ) {
       const nextNode = node.next;
       if (nextNode?.data[0] === key) {
killedBy: hash table delete should successfully delete an entry in a table with many collisions without affecting access to the remaining members
statusReason: KeyNotFoundError: Key not found: "entry0".

[Killed] EqualityOperator
src/data-structures/hash-table.ts:96:32
       list.removeBeginning();
       return;
     }
-    for (let node = list.root; node !== undefined; ) {
+    for (let node = list.root; node === undefined; ) {
       const nextNode = node.next;
       if (nextNode?.data[0] === key) {
killedBy: hash table delete should successfully delete an entry in a table with many collisions without affecting access to the remaining members
statusReason: KeyNotFoundError: Key not found: "entry2".

[Killed] ConditionalExpression
src/data-structures/hash-table.ts:98:11
     }
     for (let node = list.root; node !== undefined; ) {
       const nextNode = node.next;
-      if (nextNode?.data[0] === key) {
+      if (true) {
         list.removeAfter(node);
         return;
killedBy: hash table delete should not alter the table if the key is not found, even when the key collides with existing keys
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] EqualityOperator
src/data-structures/hash-table.ts:98:11
     }
     for (let node = list.root; node !== undefined; ) {
       const nextNode = node.next;
-      if (nextNode?.data[0] === key) {
+      if (nextNode?.data[0] !== key) {
         list.removeAfter(node);
         return;
killedBy: hash table delete should not alter the table if the key is not found, even when the key collides with existing keys
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/data-structures/hash-table.ts:104:9
       }
       node = nextNode;
     }
-    if (throwIfNotFound) {
+    if (false) {
       throw new KeyNotFoundError(key);
     }
killedBy: hash table delete should not alter the table if the key is not found, even when the key collides with existing keys
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] BlockStatement
src/data-structures/hash-table.ts:104:26
       }
       node = nextNode;
     }
-    if (throwIfNotFound) {
-      throw new KeyNotFoundError(key);
-    }
+    if (throwIfNotFound) {}
   }
 
killedBy: hash table delete should not alter the table if the key is not found, even when the key collides with existing keys
statusReason: Error: expect(received).toThrow()

Received function did not throw
