[Killed] BlockStatement
src/data-structures/queue.ts:21:49
 export class QueueArray<ElementType> implements Queue<ElementType> {
   #array: Array<ElementType> = [];
 
-  constructor(iterable?: Iterable<ElementType>) {
-    if (iterable) {
-      this.#array = Array.from(iterable);
-    }
-  }
+  constructor(iterable?: Iterable<ElementType>) {}
 
   add(item: ElementType) {
killedBy: queue (array implementation) constructor should successfully initialize the elements of a queue given an iterable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ConditionalExpression
src/data-structures/queue.ts:22:9
   #array: Array<ElementType> = [];
 
   constructor(iterable?: Iterable<ElementType>) {
-    if (iterable) {
+    if (true) {
       this.#array = Array.from(iterable);
     }
killedBy: queue (array implementation) add, remove, first removing elements from an empty queue should not change the length
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
src/data-structures/queue.ts:22:9
   #array: Array<ElementType> = [];
 
   constructor(iterable?: Iterable<ElementType>) {
-    if (iterable) {
+    if (false) {
       this.#array = Array.from(iterable);
     }
killedBy: queue (array implementation) constructor should successfully initialize the elements of a queue given an iterable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/data-structures/queue.ts:27:26
     }
   }
 
-  add(item: ElementType) {
-    this.#array.push(item);
-  }
+  add(item: ElementType) {}
   remove() {
     return this.#array.shift();
killedBy: queue (array implementation) add, remove, first removing elements from an empty queue should not change the length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/data-structures/queue.ts:30:12
   add(item: ElementType) {
     this.#array.push(item);
   }
-  remove() {
-    return this.#array.shift();
-  }
+  remove() {}
   get first() {
     return this.#array.at(0);
killedBy: queue (array implementation) constructor should successfully initialize the elements of a queue given an iterable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/data-structures/queue.ts:33:15
   remove() {
     return this.#array.shift();
   }
-  get first() {
-    return this.#array.at(0);
-  }
+  get first() {}
   get isEmpty() {
     return this.#array.length === 0;
killedBy: queue (array implementation) add, remove, first should successfully add an element to an empty queue
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 462
Received: undefined

[Killed] BlockStatement
src/data-structures/queue.ts:36:17
   get first() {
     return this.#array.at(0);
   }
-  get isEmpty() {
-    return this.#array.length === 0;
-  }
+  get isEmpty() {}
   get length() {
     return this.#array.length;
killedBy: queue (array implementation) isEmpty should indicate that an empty queue is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/data-structures/queue.ts:37:12
     return this.#array.at(0);
   }
   get isEmpty() {
-    return this.#array.length === 0;
+    return false;
   }
   get length() {
killedBy: queue (array implementation) isEmpty should indicate that an empty queue is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/data-structures/queue.ts:37:12
     return this.#array.at(0);
   }
   get isEmpty() {
-    return this.#array.length === 0;
+    return true;
   }
   get length() {
killedBy: queue (array implementation) isEmpty should indicate that a previously filled but now-empty queue is empty
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not true

[Killed] BlockStatement
src/data-structures/queue.ts:39:16
   get isEmpty() {
     return this.#array.length === 0;
   }
-  get length() {
-    return this.#array.length;
-  }
+  get length() {}
 }
 
killedBy: queue (array implementation) add, remove, first removing elements from an empty queue should not change the length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/data-structures/queue.ts:49:49
   #last: SinglyLinkedNode<ElementType> | undefined;
   #length: number = 0;
 
-  constructor(iterable?: Iterable<ElementType>) {
-    this.#list = new SinglyLinkedList();
-    if (iterable) {
-      for (const item of iterable) {
-        this.add(item);
-      }
-    }
-  }
+  constructor(iterable?: Iterable<ElementType>) {}
 
   add(item: ElementType) {
killedBy: queue (LinkedList implementation) constructor should successfully initialize the elements of a queue given an iterable
statusReason: TypeError: Cannot read properties of undefined (reading 'root')

[Killed] BlockStatement
src/data-structures/queue.ts:51:19
 
   constructor(iterable?: Iterable<ElementType>) {
     this.#list = new SinglyLinkedList();
-    if (iterable) {
-      for (const item of iterable) {
-        this.add(item);
-      }
-    }
+    if (iterable) {}
   }
 
killedBy: queue (LinkedList implementation) constructor should successfully initialize the elements of a queue given an iterable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ConditionalExpression
src/data-structures/queue.ts:51:9
 
   constructor(iterable?: Iterable<ElementType>) {
     this.#list = new SinglyLinkedList();
-    if (iterable) {
+    if (false) {
       for (const item of iterable) {
         this.add(item);
killedBy: queue (LinkedList implementation) constructor should successfully initialize the elements of a queue given an iterable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/data-structures/queue.ts:52:36
   constructor(iterable?: Iterable<ElementType>) {
     this.#list = new SinglyLinkedList();
     if (iterable) {
-      for (const item of iterable) {
-        this.add(item);
-      }
+      for (const item of iterable) {}
     }
   }
killedBy: queue (LinkedList implementation) constructor should successfully initialize the elements of a queue given an iterable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/data-structures/queue.ts:58:26
     }
   }
 
-  add(item: ElementType) {
-    this.#length += 1;
-    const node = new SinglyLinkedNode(item);
-    const previousLast = this.#last;
-    this.#last = node;
-    if (this.isEmpty) {
-      this.#list.insertBeginning(node);
-      return;
-    }
-    this.#list.insertAfter(previousLast!, node);
-  }
+  add(item: ElementType) {}
 
   remove() {
killedBy: queue (LinkedList implementation) constructor should successfully initialize the elements of a queue given an iterable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] AssignmentOperator
src/data-structures/queue.ts:59:5
   }
 
   add(item: ElementType) {
-    this.#length += 1;
+    this.#length -= 1;
     const node = new SinglyLinkedNode(item);
     const previousLast = this.#last;
killedBy: queue (LinkedList implementation) add, remove, first removing elements from an empty queue should not change the length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] ConditionalExpression
src/data-structures/queue.ts:63:9
     const node = new SinglyLinkedNode(item);
     const previousLast = this.#last;
     this.#last = node;
-    if (this.isEmpty) {
+    if (false) {
       this.#list.insertBeginning(node);
       return;
killedBy: queue (LinkedList implementation) constructor should successfully initialize the elements of a queue given an iterable
statusReason: TypeError: Cannot read properties of undefined (reading 'next')

[Killed] BlockStatement
src/data-structures/queue.ts:63:23
     const node = new SinglyLinkedNode(item);
     const previousLast = this.#last;
     this.#last = node;
-    if (this.isEmpty) {
-      this.#list.insertBeginning(node);
-      return;
-    }
+    if (this.isEmpty) {}
     this.#list.insertAfter(previousLast!, node);
   }
killedBy: queue (LinkedList implementation) constructor should successfully initialize the elements of a queue given an iterable
statusReason: TypeError: Cannot read properties of undefined (reading 'next')

[Killed] BlockStatement
src/data-structures/queue.ts:70:12
     this.#list.insertAfter(previousLast!, node);
   }
 
-  remove() {
-    const value = this.first;
-    this.#list.removeBeginning();
-    if (value !== undefined) {
-      this.#length -= 1;
-    }
-    return value;
-  }
+  remove() {}
   get first() {
     return this.#list.root?.data;
killedBy: queue (LinkedList implementation) constructor should successfully initialize the elements of a queue given an iterable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ConditionalExpression
src/data-structures/queue.ts:73:9
   remove() {
     const value = this.first;
     this.#list.removeBeginning();
-    if (value !== undefined) {
+    if (true) {
       this.#length -= 1;
     }
killedBy: queue (LinkedList implementation) add, remove, first removing elements from an empty queue should not change the length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -1

[Killed] BlockStatement
src/data-structures/queue.ts:73:30
   remove() {
     const value = this.first;
     this.#list.removeBeginning();
-    if (value !== undefined) {
-      this.#length -= 1;
-    }
+    if (value !== undefined) {}
     return value;
   }
killedBy: queue (LinkedList implementation) add, remove, first removing elements from an empty queue should not change the length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] AssignmentOperator
src/data-structures/queue.ts:74:7
     const value = this.first;
     this.#list.removeBeginning();
     if (value !== undefined) {
-      this.#length -= 1;
+      this.#length += 1;
     }
     return value;
killedBy: queue (LinkedList implementation) add, remove, first removing elements from an empty queue should not change the length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] BlockStatement
src/data-structures/queue.ts:78:15
     }
     return value;
   }
-  get first() {
-    return this.#list.root?.data;
-  }
+  get first() {}
   get isEmpty() {
     return this.#list.root === undefined;
killedBy: queue (LinkedList implementation) constructor should successfully initialize the elements of a queue given an iterable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] OptionalChaining
src/data-structures/queue.ts:79:12
     return value;
   }
   get first() {
-    return this.#list.root?.data;
+    return this.#list.root.data;
   }
   get isEmpty() {
killedBy: queue (LinkedList implementation) add, remove, first removing elements from an empty queue should not change the length
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] BlockStatement
src/data-structures/queue.ts:81:17
   get first() {
     return this.#list.root?.data;
   }
-  get isEmpty() {
-    return this.#list.root === undefined;
-  }
+  get isEmpty() {}
   get length() {
     // A less-efficient implementation would be to return `this.#list.length`, instead
killedBy: queue (LinkedList implementation) constructor should successfully initialize the elements of a queue given an iterable
statusReason: TypeError: Cannot read properties of undefined (reading 'next')

[Killed] EqualityOperator
src/data-structures/queue.ts:82:12
     return this.#list.root?.data;
   }
   get isEmpty() {
-    return this.#list.root === undefined;
+    return this.#list.root !== undefined;
   }
   get length() {
killedBy: queue (LinkedList implementation) constructor should successfully initialize the elements of a queue given an iterable
statusReason: TypeError: Cannot read properties of undefined (reading 'next')

[Killed] ConditionalExpression
src/data-structures/queue.ts:82:12
     return this.#list.root?.data;
   }
   get isEmpty() {
-    return this.#list.root === undefined;
+    return false;
   }
   get length() {
killedBy: queue (LinkedList implementation) constructor should successfully initialize the elements of a queue given an iterable
statusReason: TypeError: Cannot read properties of undefined (reading 'next')

[Killed] BlockStatement
src/data-structures/queue.ts:84:16
   get isEmpty() {
     return this.#list.root === undefined;
   }
-  get length() {
-    // A less-efficient implementation would be to return `this.#list.length`, instead
-    // of tracking the length via counting in add/remove.
-    return this.#length;
-  }
+  get length() {}
 }
 
killedBy: queue (LinkedList implementation) add, remove, first removing elements from an empty queue should not change the length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined
