[Killed] BlockStatement
src/data-structures/singly-linked-list.ts:16:43
 export class SinglyLinkedList<T> implements LinkedList<T> {
   #root?: SinglyLinkedNode<T>;
 
-  constructor(root?: SinglyLinkedNode<T>) {
-    this.#root = root;
-  }
+  constructor(root?: SinglyLinkedNode<T>) {}
 
   insertBeginning(newRoot: SinglyLinkedNode<T>) {
killedBy: singly linked list constructor successfully assigns root node when one is provided
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not 0

[Killed] BlockStatement
src/data-structures/singly-linked-list.ts:20:49
     this.#root = root;
   }
 
-  insertBeginning(newRoot: SinglyLinkedNode<T>) {
-    newRoot.next = this.#root;
-    this.#root = newRoot;
-  }
+  insertBeginning(newRoot: SinglyLinkedNode<T>) {}
 
   insertAfter(node: SinglyLinkedNode<T>, newNode: SinglyLinkedNode<T>) {
killedBy: queue (LinkedList implementation) constructor should successfully initialize the elements of a queue given an iterable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/data-structures/singly-linked-list.ts:25:72
     this.#root = newRoot;
   }
 
-  insertAfter(node: SinglyLinkedNode<T>, newNode: SinglyLinkedNode<T>) {
-    newNode.next = node.next;
-    node.next = newNode;
-  }
+  insertAfter(node: SinglyLinkedNode<T>, newNode: SinglyLinkedNode<T>) {}
 
   removeBeginning() {
killedBy: queue (LinkedList implementation) constructor should successfully initialize the elements of a queue given an iterable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] BlockStatement
src/data-structures/singly-linked-list.ts:30:21
     node.next = newNode;
   }
 
-  removeBeginning() {
-    const newRoot = this.#root?.next;
-    if (newRoot === undefined) {
-      deleteObjectProperties(this.#root);
-      this.#root = undefined;
-      return;
-    }
-    this.#root = newRoot;
-  }
+  removeBeginning() {}
 
   removeAfter(node: SinglyLinkedNode<T>) {
killedBy: queue (LinkedList implementation) constructor should successfully initialize the elements of a queue given an iterable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
src/data-structures/singly-linked-list.ts:32:9
 
   removeBeginning() {
     const newRoot = this.#root?.next;
-    if (newRoot === undefined) {
+    if (true) {
       deleteObjectProperties(this.#root);
       this.#root = undefined;
killedBy: queue (LinkedList implementation) constructor should successfully initialize the elements of a queue given an iterable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] EqualityOperator
src/data-structures/singly-linked-list.ts:32:9
 
   removeBeginning() {
     const newRoot = this.#root?.next;
-    if (newRoot === undefined) {
+    if (newRoot !== undefined) {
       deleteObjectProperties(this.#root);
       this.#root = undefined;
killedBy: queue (LinkedList implementation) constructor should successfully initialize the elements of a queue given an iterable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] BlockStatement
src/data-structures/singly-linked-list.ts:40:42
     this.#root = newRoot;
   }
 
-  removeAfter(node: SinglyLinkedNode<T>) {
-    const newNextNode = node.next?.next;
-    deleteObjectProperties(node.next);
-    node.next = newNextNode;
-  }
+  removeAfter(node: SinglyLinkedNode<T>) {}
 
   get root() {
killedBy: singly linked list with 3 elements length is reduced by 1 after calling removeAfter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] OptionalChaining
src/data-structures/singly-linked-list.ts:41:25
   }
 
   removeAfter(node: SinglyLinkedNode<T>) {
-    const newNextNode = node.next?.next;
+    const newNextNode = node.next.next;
     deleteObjectProperties(node.next);
     node.next = newNextNode;
killedBy: singly linked list with 1 element removeAfter does nothing
statusReason: TypeError: Cannot read properties of undefined (reading 'next')

[Killed] BlockStatement
src/data-structures/singly-linked-list.ts:60:54
     return count;
   }
 
-  [Symbol.iterator](): Iterator<SinglyLinkedNode<T>> {
-    let current = this.root;
-    return {
-      next() {
-        if (current === undefined) {
-          return { value: undefined, done: true };
-        }
-        const result = { value: current, done: false };
-        current = current.next;
-        return result;
-      },
-    };
-  }
+  [Symbol.iterator](): Iterator<SinglyLinkedNode<T>> {}
 
   // Stryker disable all
killedBy: singly linked list empty empty linked list is not iterable
statusReason: TypeError: Result of the Symbol.iterator method is not an object

[Killed] EqualityOperator
src/data-structures/singly-linked-list.ts:64:13
     let current = this.root;
     return {
       next() {
-        if (current === undefined) {
+        if (current !== undefined) {
           return { value: undefined, done: true };
         }
killedBy: singly linked list empty empty linked list is not iterable
statusReason: TypeError: Cannot read properties of undefined (reading 'next')
