[Killed] BlockStatement
src/data-structures/skip-list.ts:44:5
       constructor: CollectionConstructor<T>;
     },
     maxPromotions: number = Infinity,
-  ) {
-    this.#probabilityFunction = probabilityFunction;
-    this.#maxPromotions = maxPromotions;
-    const collection = collectionParams?.collection;
-    if (collection === undefined) {
-      return;
-    }
-
-    for (const item of collection) {
-      this.insert(item);
-    }
-  }
+  ) {}
 
   get length(): number {
killedBy: skip list constructor includes fixed collection params assigns a head with the correct value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] OptionalChaining
src/data-structures/skip-list.ts:47:24
   ) {
     this.#probabilityFunction = probabilityFunction;
     this.#maxPromotions = maxPromotions;
-    const collection = collectionParams?.collection;
+    const collection = collectionParams.collection;
     if (collection === undefined) {
       return;
killedBy: skip list constructor no collection parameter passed in does not assign a head
statusReason: TypeError: Cannot read properties of undefined (reading 'collection')

[Killed] EqualityOperator
src/data-structures/skip-list.ts:48:9
     this.#probabilityFunction = probabilityFunction;
     this.#maxPromotions = maxPromotions;
     const collection = collectionParams?.collection;
-    if (collection === undefined) {
+    if (collection !== undefined) {
       return;
     }
killedBy: skip list constructor no collection parameter passed in does not assign a head
statusReason: TypeError: collection is not iterable

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:48:9
     this.#probabilityFunction = probabilityFunction;
     this.#maxPromotions = maxPromotions;
     const collection = collectionParams?.collection;
-    if (collection === undefined) {
+    if (false) {
       return;
     }
killedBy: skip list constructor no collection parameter passed in does not assign a head
statusReason: TypeError: collection is not iterable

[Killed] BlockStatement
src/data-structures/skip-list.ts:52:36
       return;
     }
 
-    for (const item of collection) {
-      this.insert(item);
-    }
+    for (const item of collection) {}
   }
 
killedBy: skip list constructor includes fixed collection params assigns a head with the correct value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/data-structures/skip-list.ts:57:24
     }
   }
 
-  get length(): number {
-    if (this.head === undefined) {
-      return 0;
-    }
-    let count = 1;
-    let node: SkipListNode<T> = this.head;
-    while (node.down !== undefined) {
-      node = node.down;
-    }
-    while (node.next !== undefined) {
-      node = node.next;
-      count += 1;
-    }
-    return count;
-  }
+  get length(): number {}
 
   contains(value: T) {
killedBy: skip list constructor no collection parameter passed in returns zero length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] EqualityOperator
src/data-structures/skip-list.ts:58:9
   }
 
   get length(): number {
-    if (this.head === undefined) {
+    if (this.head !== undefined) {
       return 0;
     }
killedBy: skip list constructor no collection parameter passed in returns zero length
statusReason: TypeError: Cannot read properties of undefined (reading 'down')

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:58:9
   }
 
   get length(): number {
-    if (this.head === undefined) {
+    if (true) {
       return 0;
     }
killedBy: skip list constructor includes fixed collection params returns the correct length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] EqualityOperator
src/data-structures/skip-list.ts:63:12
     }
     let count = 1;
     let node: SkipListNode<T> = this.head;
-    while (node.down !== undefined) {
+    while (node.down === undefined) {
       node = node.down;
     }
killedBy: skip list constructor includes fixed collection params returns the correct length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 2

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:63:12
     }
     let count = 1;
     let node: SkipListNode<T> = this.head;
-    while (node.down !== undefined) {
+    while (false) {
       node = node.down;
     }
killedBy: skip list constructor includes fixed collection params returns the correct length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 2

[Killed] EqualityOperator
src/data-structures/skip-list.ts:66:12
     while (node.down !== undefined) {
       node = node.down;
     }
-    while (node.next !== undefined) {
+    while (node.next === undefined) {
       node = node.next;
       count += 1;
killedBy: skip list constructor includes fixed collection params returns the correct length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 1

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:66:12
     while (node.down !== undefined) {
       node = node.down;
     }
-    while (node.next !== undefined) {
+    while (false) {
       node = node.next;
       count += 1;
killedBy: skip list constructor includes fixed collection params returns the correct length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 1

[Killed] AssignmentOperator
src/data-structures/skip-list.ts:68:7
     }
     while (node.next !== undefined) {
       node = node.next;
-      count += 1;
+      count -= 1;
     }
     return count;
killedBy: skip list constructor includes fixed collection params returns the correct length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: -3

[Killed] BlockStatement
src/data-structures/skip-list.ts:73:22
     return count;
   }
 
-  contains(value: T) {
-    if (this.head === undefined) {
-      return false;
-    }
-    let node: SkipListNode<T> = this.head;
-    let nextNode: SkipListNode<T> | undefined = node.next;
-    while (true) {
-      if (node.data === value) {
-        return true;
-      }
-      if (nextNode === undefined || nextNode.data > value) {
-        if (node.down !== undefined) {
-          // descend
-          node = node.down;
-          nextNode = node.next;
-          continue;
-        }
-        // cannot descend and the next node is either undefined or greater than
-        // the target value, so the target value is not in the skip list
-        return false;
-      }
-      node = nextNode;
-      nextNode = node.next;
-    }
-  }
+  contains(value: T) {}
 
   at(index: number): T {
killedBy: skip list contains should return false when the list is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] EqualityOperator
src/data-structures/skip-list.ts:74:9
   }
 
   contains(value: T) {
-    if (this.head === undefined) {
+    if (this.head !== undefined) {
       return false;
     }
killedBy: skip list contains should return false when the list is empty
statusReason: TypeError: Cannot read properties of undefined (reading 'next')

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:74:9
   }
 
   contains(value: T) {
-    if (this.head === undefined) {
+    if (false) {
       return false;
     }
killedBy: skip list contains should return false when the list is empty
statusReason: TypeError: Cannot read properties of undefined (reading 'next')

[Killed] BooleanLiteral
src/data-structures/skip-list.ts:75:14
 
   contains(value: T) {
     if (this.head === undefined) {
-      return false;
+      return true;
     }
     let node: SkipListNode<T> = this.head;
killedBy: skip list contains should return false when the list is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/data-structures/skip-list.ts:79:12
     }
     let node: SkipListNode<T> = this.head;
     let nextNode: SkipListNode<T> | undefined = node.next;
-    while (true) {
+    while (false) {
       if (node.data === value) {
         return true;
killedBy: skip list contains should return false when the list does not contain the target value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] EqualityOperator
src/data-structures/skip-list.ts:80:11
     let node: SkipListNode<T> = this.head;
     let nextNode: SkipListNode<T> | undefined = node.next;
     while (true) {
-      if (node.data === value) {
+      if (node.data !== value) {
         return true;
       }
killedBy: skip list contains should return false when the list does not contain the target value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:80:11
     let node: SkipListNode<T> = this.head;
     let nextNode: SkipListNode<T> | undefined = node.next;
     while (true) {
-      if (node.data === value) {
+      if (true) {
         return true;
       }
killedBy: skip list contains should return false when the list does not contain the target value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/data-structures/skip-list.ts:81:16
     let nextNode: SkipListNode<T> | undefined = node.next;
     while (true) {
       if (node.data === value) {
-        return true;
+        return false;
       }
       if (nextNode === undefined || nextNode.data > value) {
killedBy: skip list contains should return true when the list contains the target value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/data-structures/skip-list.ts:83:11
       if (node.data === value) {
         return true;
       }
-      if (nextNode === undefined || nextNode.data > value) {
+      if (nextNode === undefined && nextNode.data > value) {
         if (node.down !== undefined) {
           // descend
killedBy: skip list contains should return false when the list does not contain the target value
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] EqualityOperator
src/data-structures/skip-list.ts:83:37
       if (node.data === value) {
         return true;
       }
-      if (nextNode === undefined || nextNode.data > value) {
+      if (nextNode === undefined || nextNode.data >= value) {
         if (node.down !== undefined) {
           // descend
killedBy: skip list contains should return true when the list contains the target value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:84:13
         return true;
       }
       if (nextNode === undefined || nextNode.data > value) {
-        if (node.down !== undefined) {
+        if (false) {
           // descend
           node = node.down;
killedBy: skip list contains should return true when the list contains the target value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:84:13
         return true;
       }
       if (nextNode === undefined || nextNode.data > value) {
-        if (node.down !== undefined) {
+        if (true) {
           // descend
           node = node.down;
killedBy: skip list contains should return false when the list does not contain the target value
statusReason: TypeError: Cannot read properties of undefined (reading 'next')

[Killed] BooleanLiteral
src/data-structures/skip-list.ts:92:16
         }
         // cannot descend and the next node is either undefined or greater than
         // the target value, so the target value is not in the skip list
-        return false;
+        return true;
       }
       node = nextNode;
killedBy: skip list contains should return false when the list does not contain the target value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:107:22
      * - Case 3: sum(nextLengths) + nextLength < index, add the nextLength to
      *   the sum and move to the next node
      */
-    if (index < 0 || this.head === undefined) {
+    if (index < 0 || false) {
       throw new OutOfBoundsError(index, this.length);
     }
killedBy: skip list constructor empty array collection parameter passed in should throw an OutOfBoundsError when called with an invalid index
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: OutOfBoundsError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'data')"

      218 |         } else {

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:107:9
      * - Case 3: sum(nextLengths) + nextLength < index, add the nextLength to
      *   the sum and move to the next node
      */
-    if (index < 0 || this.head === undefined) {
+    if (false) {
       throw new OutOfBoundsError(index, this.length);
     }
killedBy: skip list constructor empty array collection parameter passed in should throw an OutOfBoundsError when called with an invalid index
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: OutOfBoundsError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'data')"

      218 |         } else {

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:110:9
     if (index < 0 || this.head === undefined) {
       throw new OutOfBoundsError(index, this.length);
     }
-    if (index === 0) {
+    if (false) {
       return this.head.data;
     }
killedBy: skip list at (indexing) short fixed list returns the correct value for each index
statusReason: MissingIndexError: Skip list is not formed correctly, lacks index: 0.

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:110:9
     if (index < 0 || this.head === undefined) {
       throw new OutOfBoundsError(index, this.length);
     }
-    if (index === 0) {
+    if (true) {
       return this.head.data;
     }
killedBy: skip list remove correctly removes the head node from a single element skip list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BooleanLiteral
src/data-structures/skip-list.ts:116:12
     let node: SkipListNode<T> = this.head;
     let nextNode: SkipListNode<T> | undefined = node.next;
     let sumNextLengths = 0;
-    while (true) {
+    while (false) {
       const nextSum = sumNextLengths + (node.nextLength ?? 0);
       if (nextSum === index) {
killedBy: skip list remove correctly removes the head node from a single element skip list
statusReason: TypeError: Cannot read properties of undefined (reading 'nextLength')

[Killed] ArithmeticOperator
src/data-structures/skip-list.ts:117:23
     let nextNode: SkipListNode<T> | undefined = node.next;
     let sumNextLengths = 0;
     while (true) {
-      const nextSum = sumNextLengths + (node.nextLength ?? 0);
+      const nextSum = sumNextLengths - (node.nextLength ?? 0);
       if (nextSum === index) {
         return nextNode!.data;
killedBy: skip list remove short fixed list completely removes the head column when targeting the head value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   2,
-   3,

[Killed] LogicalOperator
src/data-structures/skip-list.ts:117:41
     let nextNode: SkipListNode<T> | undefined = node.next;
     let sumNextLengths = 0;
     while (true) {
-      const nextSum = sumNextLengths + (node.nextLength ?? 0);
+      const nextSum = sumNextLengths + (node.nextLength && 0);
       if (nextSum === index) {
         return nextNode!.data;
killedBy: skip list remove short fixed list completely removes the head column when targeting the head value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   2,
-   3,

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:118:11
     let sumNextLengths = 0;
     while (true) {
       const nextSum = sumNextLengths + (node.nextLength ?? 0);
-      if (nextSum === index) {
+      if (true) {
         return nextNode!.data;
       }
killedBy: skip list remove short fixed list completely removes the head column when targeting the head value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   3,
    2,

[Killed] EqualityOperator
src/data-structures/skip-list.ts:118:11
     let sumNextLengths = 0;
     while (true) {
       const nextSum = sumNextLengths + (node.nextLength ?? 0);
-      if (nextSum === index) {
+      if (nextSum !== index) {
         return nextNode!.data;
       }
killedBy: skip list remove short fixed list completely removes the head column when targeting the head value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   3,
    2,

[Killed] LogicalOperator
src/data-structures/skip-list.ts:122:11
         return nextNode!.data;
       }
       // Stryker disable next-line EqualityOperator: equality is handled by clause above
-      if (nextNode === undefined || nextSum > index) {
+      if (nextNode === undefined && nextSum > index) {
         if (node.down !== undefined) {
           // descend
killedBy: skip list at (indexing) invalid list should throw a MissingIndexError when 'at' is called for an index that appears to be skipped
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: MissingIndexError
Received constructor: OutOfBoundsError

Received message: "Index (3) exceeds the length of the collection (5)."

      262 |                 } else {

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:122:11
         return nextNode!.data;
       }
       // Stryker disable next-line EqualityOperator: equality is handled by clause above
-      if (nextNode === undefined || nextSum > index) {
+      if (false) {
         if (node.down !== undefined) {
           // descend
killedBy: skip list at (indexing) invalid list should throw a MissingIndexError when 'at' is called for an index that appears to be skipped
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: MissingIndexError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'next')"

      271 |           sumNextLengths = nextSum;

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:123:13
       }
       // Stryker disable next-line EqualityOperator: equality is handled by clause above
       if (nextNode === undefined || nextSum > index) {
-        if (node.down !== undefined) {
+        if (true) {
           // descend
           node = node.down;
killedBy: skip list at (indexing) invalid list should throw a MissingIndexError when 'at' is called for an index that appears to be skipped
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: MissingIndexError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'next')"

      251 |                   // descend

[Killed] EqualityOperator
src/data-structures/skip-list.ts:123:13
       }
       // Stryker disable next-line EqualityOperator: equality is handled by clause above
       if (nextNode === undefined || nextSum > index) {
-        if (node.down !== undefined) {
+        if (node.down === undefined) {
           // descend
           node = node.down;
killedBy: skip list at (indexing) invalid list should throw a MissingIndexError when 'at' is called for an index that appears to be skipped
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: MissingIndexError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'next')"

      251 |                   // descend

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:131:13
         }
         // cannot descend
         // if the next node is undefined, then the index is invalid (out of bounds)
-        if (nextNode === undefined) {
+        if (false) {
           throw new OutOfBoundsError(index, this.length);
         }
killedBy: skip list at (indexing) short fixed list should throw an OutOfBoundsError when called with an invalid index
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: OutOfBoundsError
Received constructor: MissingIndexError

Received message: "Skip list is not formed correctly, lacks index: 5."

      266 |               }

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:131:13
         }
         // cannot descend
         // if the next node is undefined, then the index is invalid (out of bounds)
-        if (nextNode === undefined) {
+        if (true) {
           throw new OutOfBoundsError(index, this.length);
         }
killedBy: skip list at (indexing) invalid list should throw a MissingIndexError when 'at' is called for an index that appears to be skipped
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: MissingIndexError
Received constructor: OutOfBoundsError

Received message: "Index (3) exceeds the length of the collection (5)."

      262 |                 } else {

[Killed] EqualityOperator
src/data-structures/skip-list.ts:144:9
   }
 
   insert(value: T) {
-    if (this.head === undefined) {
+    if (this.head !== undefined) {
       this.head = new SkipListNode<T>(value);
       return;
killedBy: skip list constructor includes fixed collection params assigns a head with the correct value
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:144:9
   }
 
   insert(value: T) {
-    if (this.head === undefined) {
+    if (false) {
       this.head = new SkipListNode<T>(value);
       return;
killedBy: skip list constructor includes fixed collection params assigns a head with the correct value
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] EqualityOperator
src/data-structures/skip-list.ts:149:9
       return;
     }
     // Stryker disable next-line ConditionalExpression, BlockStatement: optimization
-    if (this.head.data === value) {
+    if (this.head.data !== value) {
       // do not insert duplicate nodes
       return;
killedBy: skip list constructor includes fixed collection params returns the correct length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 1

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:154:9
       return;
     }
     // Stryker disable next-line EqualityOperator: equality is handled by clause above
-    if (this.head.data > value) {
+    if (false) {
       this.#insertAsHead(value);
       return;
killedBy: skip list insert should correctly insert a new head value when the value is less than all elements in the list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] BlockStatement
src/data-structures/skip-list.ts:154:33
       return;
     }
     // Stryker disable next-line EqualityOperator: equality is handled by clause above
-    if (this.head.data > value) {
-      this.#insertAsHead(value);
-      return;
-    }
+    if (this.head.data > value) {}
 
     // traverse the list, tracking the nodes that we descend from as we go
killedBy: skip list insert should correctly insert a new head value when the value is less than all elements in the list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] BooleanLiteral
src/data-structures/skip-list.ts:165:12
     let nextNode: SkipListNode<T> | undefined = this.head.next;
     const lengthToEndNodesByLayer: Array<number> = [];
     let lengthTraversedCurrentLayer = 0;
-    while (true) {
+    while (false) {
       if (node.data === value) {
         // do not insert duplicate values
killedBy: skip list constructor includes fixed collection params returns the correct length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 1

[Killed] BlockStatement
src/data-structures/skip-list.ts:166:32
     const lengthToEndNodesByLayer: Array<number> = [];
     let lengthTraversedCurrentLayer = 0;
     while (true) {
-      if (node.data === value) {
-        // do not insert duplicate values
-        return;
-      }
+      if (node.data === value) {}
       if (nextNode === undefined || nextNode.data > value) {
         endNodesByLayer.push(node);
killedBy: skip list insert should not alter the list structure when attempting to add duplicate elements greater than the head
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 4

[Killed] EqualityOperator
src/data-structures/skip-list.ts:170:37
         // do not insert duplicate values
         return;
       }
-      if (nextNode === undefined || nextNode.data > value) {
+      if (nextNode === undefined || nextNode.data <= value) {
         endNodesByLayer.push(node);
         lengthToEndNodesByLayer.push(lengthTraversedCurrentLayer);
killedBy: skip list constructor includes fixed collection params returns the correct values for the lowest layer
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    1,
-   2,

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:170:11
         // do not insert duplicate values
         return;
       }
-      if (nextNode === undefined || nextNode.data > value) {
+      if (true) {
         endNodesByLayer.push(node);
         lengthToEndNodesByLayer.push(lengthTraversedCurrentLayer);
killedBy: skip list constructor includes fixed collection params returns the correct values for the lowest layer
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    1,
-   2,

[Killed] EqualityOperator
src/data-structures/skip-list.ts:174:13
         endNodesByLayer.push(node);
         lengthToEndNodesByLayer.push(lengthTraversedCurrentLayer);
         // lengthTraversedCurrentLayer = 0;
-        if (node.down !== undefined) {
+        if (node.down === undefined) {
           // descend from node
           node = node.down;
killedBy: skip list constructor includes fixed collection params assigns a head with the correct value
statusReason: TypeError: Cannot read properties of undefined (reading 'next')

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:174:13
         endNodesByLayer.push(node);
         lengthToEndNodesByLayer.push(lengthTraversedCurrentLayer);
         // lengthTraversedCurrentLayer = 0;
-        if (node.down !== undefined) {
+        if (false) {
           // descend from node
           node = node.down;
killedBy: skip list constructor includes fixed collection params returns the correct values for the lowest layer
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    1,
    2,

[Killed] AssignmentOperator
src/data-structures/skip-list.ts:189:7
         );
         return;
       }
-      lengthTraversedCurrentLayer += node.nextLength!;
+      lengthTraversedCurrentLayer -= node.nextLength!;
       node = nextNode;
       nextNode = node.next;
killedBy: skip list remove short fixed list completely removes the head column when targeting the head value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   2,
-   3,

[Killed] BlockStatement
src/data-structures/skip-list.ts:198:22
   #insertAfter(
     valueToInsert: T,
     previousNode: SkipListNode<T>,
-  ): SkipListNode<T> {
-    const previousNext = previousNode.next;
-    previousNode.next = new SkipListNode(valueToInsert);
-    previousNode.next.next = previousNext;
-    previousNode.next.nextLength = previousNext === undefined ? undefined : 1;
-    previousNode.nextLength = 1;
-    return previousNode.next;
-  }
+  ): SkipListNode<T> {}
 
   #insertAsHead(value: T) {
killedBy: skip list constructor includes fixed collection params assigns a head with the correct value
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:202:36
     const previousNext = previousNode.next;
     previousNode.next = new SkipListNode(valueToInsert);
     previousNode.next.next = previousNext;
-    previousNode.next.nextLength = previousNext === undefined ? undefined : 1;
+    previousNode.next.nextLength = true ? undefined : 1;
     previousNode.nextLength = 1;
     return previousNode.next;
killedBy: skip list at (indexing) short fixed list returns the correct value for each index after inserting a new head value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3
