[Killed] ConditionalExpression
src/data-structures/skip-list.ts:202:36
     const previousNext = previousNode.next;
     previousNode.next = new SkipListNode(valueToInsert);
     previousNode.next.next = previousNext;
-    previousNode.next.nextLength = previousNext === undefined ? undefined : 1;
+    previousNode.next.nextLength = false ? undefined : 1;
     previousNode.nextLength = 1;
     return previousNode.next;
killedBy: skip list at (indexing) short fixed list should throw an OutOfBoundsError when called with an invalid index
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: OutOfBoundsError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'data')"

      235 |             } else {

[Killed] BlockStatement
src/data-structures/skip-list.ts:207:27
     return previousNode.next;
   }
 
-  #insertAsHead(value: T) {
-    // change the values of the head node column to match the new head value,
-    // then insert the former head value
-    const formerHeadValue = this.head!.data;
-    for (
-      let node: SkipListNode<T> | undefined = this.head;
-      node !== undefined;
-      node = node.down
-    ) {
-      node.data = value;
-    }
-    this.insert(formerHeadValue);
-  }
+  #insertAsHead(value: T) {}
 
   #setupPromotions(
killedBy: skip list insert should correctly insert a new head value when the value is less than all elements in the list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 3

[Killed] EqualityOperator
src/data-structures/skip-list.ts:213:7
     const formerHeadValue = this.head!.data;
     for (
       let node: SkipListNode<T> | undefined = this.head;
-      node !== undefined;
+      node === undefined;
       node = node.down
     ) {
killedBy: skip list insert should correctly insert a new head value when the value is less than all elements in the list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 3

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:213:7
     const formerHeadValue = this.head!.data;
     for (
       let node: SkipListNode<T> | undefined = this.head;
-      node !== undefined;
+      false;
       node = node.down
     ) {
killedBy: skip list insert should correctly insert a new head value when the value is less than all elements in the list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 3

[Killed] BlockStatement
src/data-structures/skip-list.ts:215:7
       let node: SkipListNode<T> | undefined = this.head;
       node !== undefined;
       node = node.down
-    ) {
-      node.data = value;
-    }
+    ) {}
     this.insert(formerHeadValue);
   }
killedBy: skip list insert should correctly insert a new head value when the value is less than all elements in the list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 3

[Killed] ArithmeticOperator
src/data-structures/skip-list.ts:229:31
     let previousNode = insertedNode;
     let numPromotions = 0;
     const totalTraversedNextLength =
-      lengthToEndNodesByLayer[lengthToEndNodesByLayer.length - 1];
+      lengthToEndNodesByLayer[lengthToEndNodesByLayer.length + 1];
     for (let i = endNodesByLayer.length - 2; i >= 0; i--) {
       // The final element is intentionally skipped
killedBy: skip list remove short fixed list completely removes the head column when targeting the head value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   2,
-   3,

[Killed] EqualityOperator
src/data-structures/skip-list.ts:230:46
     let numPromotions = 0;
     const totalTraversedNextLength =
       lengthToEndNodesByLayer[lengthToEndNodesByLayer.length - 1];
-    for (let i = endNodesByLayer.length - 2; i >= 0; i--) {
+    for (let i = endNodesByLayer.length - 2; i > 0; i--) {
       // The final element is intentionally skipped
       // Stryker disable all: randomized outcomes
killedBy: skip list insert should trigger random promotions
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not "····
{0(2) -> 2(inf)}

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:230:46
     let numPromotions = 0;
     const totalTraversedNextLength =
       lengthToEndNodesByLayer[lengthToEndNodesByLayer.length - 1];
-    for (let i = endNodesByLayer.length - 2; i >= 0; i--) {
+    for (let i = endNodesByLayer.length - 2; false; i--) {
       // The final element is intentionally skipped
       // Stryker disable all: randomized outcomes
killedBy: skip list insert should trigger random promotions
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not "····
{0(1) -> 1(inf)}

[Killed] ArithmeticOperator
src/data-structures/skip-list.ts:254:9
       newNode.next = leftEndNode.next;
       const formerNextLengthLeftEndNode = leftEndNode.nextLength;
       const newNextLengthLeftEndNode =
-        totalTraversedNextLength + 1 - lengthToEndNodesByLayer[i];
+        totalTraversedNextLength + 1 + lengthToEndNodesByLayer[i];
       const nextLengthNewNode = !IsValidFiniteNumber(
         formerNextLengthLeftEndNode,
killedBy: skip list at (indexing) short fixed list returns the correct value for each index
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 3

[Killed] ArithmeticOperator
src/data-structures/skip-list.ts:254:9
       newNode.next = leftEndNode.next;
       const formerNextLengthLeftEndNode = leftEndNode.nextLength;
       const newNextLengthLeftEndNode =
-        totalTraversedNextLength + 1 - lengthToEndNodesByLayer[i];
+        totalTraversedNextLength - 1 - lengthToEndNodesByLayer[i];
       const nextLengthNewNode = !IsValidFiniteNumber(
         formerNextLengthLeftEndNode,
killedBy: skip list at (indexing) short fixed list returns the correct value for each index
statusReason: OutOfBoundsError: Index (3) exceeds the length of the collection (5).

[Killed] BooleanLiteral
src/data-structures/skip-list.ts:255:33
       const formerNextLengthLeftEndNode = leftEndNode.nextLength;
       const newNextLengthLeftEndNode =
         totalTraversedNextLength + 1 - lengthToEndNodesByLayer[i];
-      const nextLengthNewNode = !IsValidFiniteNumber(
-        formerNextLengthLeftEndNode,
-      )
+      const nextLengthNewNode = IsValidFiniteNumber(formerNextLengthLeftEndNode)
         ? undefined
         : formerNextLengthLeftEndNode! + 1 - newNextLengthLeftEndNode;
killedBy: skip list at (indexing) short fixed list returns the correct value for each index after inserting a new head value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 5

[Killed] ArithmeticOperator
src/data-structures/skip-list.ts:259:11
         formerNextLengthLeftEndNode,
       )
         ? undefined
-        : formerNextLengthLeftEndNode! + 1 - newNextLengthLeftEndNode;
+        : formerNextLengthLeftEndNode! + 1 + newNextLengthLeftEndNode;
       newNode.nextLength = nextLengthNewNode;
       leftEndNode.next = newNode;
killedBy: skip list at (indexing) short fixed list returns the correct value for each index after inserting a new head value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 2

[Killed] ArithmeticOperator
src/data-structures/skip-list.ts:259:11
         formerNextLengthLeftEndNode,
       )
         ? undefined
-        : formerNextLengthLeftEndNode! + 1 - newNextLengthLeftEndNode;
+        : formerNextLengthLeftEndNode! - 1 - newNextLengthLeftEndNode;
       newNode.nextLength = nextLengthNewNode;
       leftEndNode.next = newNode;
killedBy: skip list at (indexing) short fixed list returns the correct value for each index after inserting a new head value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 4

[Killed] EqualityOperator
src/data-structures/skip-list.ts:269:9
       numPromotions += 1;
     }
     // Stryker disable next-line ConditionalExpression, BlockStatement: caught by state tests
-    if (numPromotions < endNodesByLayer.length - 1) {
+    if (numPromotions <= endNodesByLayer.length - 1) {
       return;
     }
killedBy: skip list constructor includes long, randomized collection params does not create a list where all nodes are present in all layers
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 1
Received:   1

[Killed] EqualityOperator
src/data-structures/skip-list.ts:269:9
       numPromotions += 1;
     }
     // Stryker disable next-line ConditionalExpression, BlockStatement: caught by state tests
-    if (numPromotions < endNodesByLayer.length - 1) {
+    if (numPromotions >= endNodesByLayer.length - 1) {
       return;
     }
killedBy: skip list constructor includes long, randomized collection params does not create a list where all nodes are present in all layers
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 1
Received:   1

[Killed] EqualityOperator
src/data-structures/skip-list.ts:274:43
     }
 
     // perform any additional promotions by creating new layers
-    while (this.#probabilityFunction() && numPromotions < this.#maxPromotions) {
+    while (this.#probabilityFunction() && numPromotions <= this.#maxPromotions) {
       // promote both the head and the node in its new layer, promote the head
       // first (the head node must be present in all layers)
killedBy: skip list constructor includes maxPromotions arg results in a list 10 layers deep
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 11

[Killed] EqualityOperator
src/data-structures/skip-list.ts:274:43
     }
 
     // perform any additional promotions by creating new layers
-    while (this.#probabilityFunction() && numPromotions < this.#maxPromotions) {
+    while (this.#probabilityFunction() && numPromotions >= this.#maxPromotions) {
       // promote both the head and the node in its new layer, promote the head
       // first (the head node must be present in all layers)
killedBy: skip list constructor includes long, randomized collection params does not create a list where all nodes are present in all layers
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 1
Received:   1

[Killed] ArithmeticOperator
src/data-structures/skip-list.ts:283:30
       // promote by inserting a node in the layer above the current layer
       const newNode = new SkipListNode<T>(previousNode.data);
       this.head.next = newNode;
-      this.head.nextLength = totalTraversedNextLength + 1;
+      this.head.nextLength = totalTraversedNextLength - 1;
       newNode.down = previousNode;
       previousNode = newNode;
killedBy: skip list at (indexing) short fixed list returns the correct value for each index
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 4

[Timeout] AssignmentOperator
src/data-structures/skip-list.ts:286:7
       this.head.nextLength = totalTraversedNextLength + 1;
       newNode.down = previousNode;
       previousNode = newNode;
-      numPromotions += 1;
+      numPromotions -= 1;
     }
   }

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:291:9
   }
 
   remove(value: T) {
-    if (this.head === undefined) {
+    if (true) {
       return;
     }
killedBy: skip list remove correctly removes the head node from a single element skip list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] EqualityOperator
src/data-structures/skip-list.ts:291:9
   }
 
   remove(value: T) {
-    if (this.head === undefined) {
+    if (this.head !== undefined) {
       return;
     }
killedBy: skip list remove does not change an empty list
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:294:9
     if (this.head === undefined) {
       return;
     }
-    if (this.head.data === value) {
+    if (true) {
       // removing the head value
       let newHeadValue: T;
killedBy: skip list remove short fixed list does not change the structure of a list if the list does not contain the target value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
-   1,
    2,

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:294:9
     if (this.head === undefined) {
       return;
     }
-    if (this.head.data === value) {
+    if (false) {
       // removing the head value
       let newHeadValue: T;
killedBy: skip list remove correctly removes the head node from a single element skip list
statusReason: TypeError: Cannot read properties of undefined (reading 'next')

[Killed] BlockStatement
src/data-structures/skip-list.ts:297:11
     if (this.head.data === value) {
       // removing the head value
       let newHeadValue: T;
-      try {
-        newHeadValue = this.at(1);
-      } catch {
+      try {} catch {
         // remove the reference to the head node, which is the only node
         deleteObjectProperties(this.head);
killedBy: skip list remove correctly removes the head node from a single element skip list
statusReason: TypeError: Cannot read properties of undefined (reading 'nextLength')

[Killed] BlockStatement
src/data-structures/skip-list.ts:299:15
       let newHeadValue: T;
       try {
         newHeadValue = this.at(1);
-      } catch {
-        // remove the reference to the head node, which is the only node
-        deleteObjectProperties(this.head);
-        this.head = undefined;
-        return;
-      }
+      } catch {}
       // change the values of the head node column to match the next value in
       // the list, and remove the nodes which originally held that value.
killedBy: skip list remove correctly removes the head node from a single element skip list
statusReason: TypeError: Cannot read properties of undefined (reading 'nextLength')

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:311:9
       return;
     }
     // ensure that the list contains the value to be removed
-    if (!this.contains(value)) {
+    if (true) {
       return;
     }
killedBy: skip list remove short fixed list completely removes the correct element from the list when targeting a value that is neither at the start nor end of the list
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    1,
    2,

[Killed] BlockStatement
src/data-structures/skip-list.ts:311:32
       return;
     }
     // ensure that the list contains the value to be removed
-    if (!this.contains(value)) {
-      return;
-    }
+    if (!this.contains(value)) {}
     // traverse the list
     let node: SkipListNode<T> = this.head;
killedBy: skip list remove short fixed list does not change the structure of a list if the list does not contain the target value
statusReason: TypeError: Cannot read properties of undefined (reading 'next')

[Killed] EqualityOperator
src/data-structures/skip-list.ts:318:11
     let node: SkipListNode<T> = this.head;
     let nextNode: SkipListNode<T> | undefined = node.next;
     while (true) {
-      if (nextNode === undefined || nextNode.data > value) {
+      if (nextNode !== undefined || nextNode.data > value) {
         // decrement the nextLength of the node being descended from
         // Stryker disable next-line ConditionalExpression: prevents NaN assignment
killedBy: skip list remove short fixed list completely removes the correct element from the list when targeting a value that is neither at the start nor end of the list
statusReason: TypeError: Cannot read properties of undefined (reading 'next')

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:318:11
     let node: SkipListNode<T> = this.head;
     let nextNode: SkipListNode<T> | undefined = node.next;
     while (true) {
-      if (nextNode === undefined || nextNode.data > value) {
+      if (true) {
         // decrement the nextLength of the node being descended from
         // Stryker disable next-line ConditionalExpression: prevents NaN assignment
killedBy: skip list remove short fixed list completely removes the correct element from the list when targeting a value that is neither at the start nor end of the list
statusReason: TypeError: Cannot read properties of undefined (reading 'next')

[Killed] BlockStatement
src/data-structures/skip-list.ts:321:51
       if (nextNode === undefined || nextNode.data > value) {
         // decrement the nextLength of the node being descended from
         // Stryker disable next-line ConditionalExpression: prevents NaN assignment
-        if (IsValidFiniteNumber(node.nextLength)) {
-          node.nextLength! -= 1;
-        }
+        if (IsValidFiniteNumber(node.nextLength)) {}
         // descend
         node = node.down!;
killedBy: skip list at (indexing) short fixed list returns the correct value for each index after one remove operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 3

[Killed] AssignmentOperator
src/data-structures/skip-list.ts:322:11
         // decrement the nextLength of the node being descended from
         // Stryker disable next-line ConditionalExpression: prevents NaN assignment
         if (IsValidFiniteNumber(node.nextLength)) {
-          node.nextLength! -= 1;
+          node.nextLength! += 1;
         }
         // descend
killedBy: skip list at (indexing) short fixed list returns the correct value for each index after one remove operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 3

[Killed] BlockStatement
src/data-structures/skip-list.ts:329:36
         nextNode = node.next;
         continue;
       }
-      if (nextNode.data === value) {
-        // remove the node while updating the nextLength of the left end node
-        this.#removeNextNode(node, nextNode);
-        if (node.down !== undefined) {
-          // descend
-          node = node.down!;
-          nextNode = node.next;
-          continue;
-        }
-        return; // finished
-      }
+      if (nextNode.data === value) {}
       node = nextNode;
       nextNode = node.next;
killedBy: skip list remove short fixed list completely removes the correct element from the list when targeting a value that is neither at the start nor end of the list
statusReason: TypeError: Cannot read properties of undefined (reading 'next')

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:329:11
         nextNode = node.next;
         continue;
       }
-      if (nextNode.data === value) {
+      if (true) {
         // remove the node while updating the nextLength of the left end node
         this.#removeNextNode(node, nextNode);
killedBy: skip list remove short fixed list completely removes the correct element from the list when targeting a value that is neither at the start nor end of the list
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
-   2,

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:332:13
       if (nextNode.data === value) {
         // remove the node while updating the nextLength of the left end node
         this.#removeNextNode(node, nextNode);
-        if (node.down !== undefined) {
+        if (false) {
           // descend
           node = node.down!;
killedBy: skip list remove short fixed list completely removes the correct element from the list when targeting a value that is neither at the start nor end of the list
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    1,
    2,

[Killed] EqualityOperator
src/data-structures/skip-list.ts:332:13
       if (nextNode.data === value) {
         // remove the node while updating the nextLength of the left end node
         this.#removeNextNode(node, nextNode);
-        if (node.down !== undefined) {
+        if (node.down === undefined) {
           // descend
           node = node.down!;
killedBy: skip list remove short fixed list completely removes the correct element from the list when targeting a value that is neither at the start nor end of the list
statusReason: TypeError: Cannot read properties of undefined (reading 'next')

[Killed] BlockStatement
src/data-structures/skip-list.ts:345:36
     }
   }
 
-  #shiftToNewHead(newHeadValue: T) {
-    for (
-      let node: SkipListNode<T> | undefined = this.head;
-      node !== undefined;
-      node = node.down
-    ) {
-      node.data = newHeadValue;
-      const nextNode = node.next;
-      node.nextLength = !IsValidFiniteNumber(node.nextLength)
-        ? undefined
-        : node.nextLength! - 1;
-      // Stryker disable next-line OptionalChaining: caught as TypeError
-      // Stryker disable next-line ConditionalExpression: optimization
-      if (nextNode?.data === newHeadValue) {
-        // remove the next node since it will be a duplicate of the new head
-        // node
-        this.#removeNextNode(node, nextNode);
-        // undo the decrementing of node.nextLength, since we are removing a
-        // duplicate node
-        node.nextLength! += 1;
-      }
-    }
-  }
+  #shiftToNewHead(newHeadValue: T) {}
 
   #removeNextNode(node: SkipListNode<T>, nextNode: SkipListNode<T>) {
killedBy: skip list remove short fixed list completely removes the head column when targeting the head value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   1,
    2,

[Killed] BlockStatement
src/data-structures/skip-list.ts:350:7
       let node: SkipListNode<T> | undefined = this.head;
       node !== undefined;
       node = node.down
-    ) {
-      node.data = newHeadValue;
-      const nextNode = node.next;
-      node.nextLength = !IsValidFiniteNumber(node.nextLength)
-        ? undefined
-        : node.nextLength! - 1;
-      // Stryker disable next-line OptionalChaining: caught as TypeError
-      // Stryker disable next-line ConditionalExpression: optimization
-      if (nextNode?.data === newHeadValue) {
-        // remove the next node since it will be a duplicate of the new head
-        // node
-        this.#removeNextNode(node, nextNode);
-        // undo the decrementing of node.nextLength, since we are removing a
-        // duplicate node
-        node.nextLength! += 1;
-      }
-    }
+    ) {}
   }
 
killedBy: skip list remove short fixed list completely removes the head column when targeting the head value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   1,
    2,

[Killed] BooleanLiteral
src/data-structures/skip-list.ts:353:25
     ) {
       node.data = newHeadValue;
       const nextNode = node.next;
-      node.nextLength = !IsValidFiniteNumber(node.nextLength)
+      node.nextLength = IsValidFiniteNumber(node.nextLength)
         ? undefined
         : node.nextLength! - 1;
killedBy: skip list at (indexing) short fixed list returns the correct value for each index after one remove operation
statusReason: OutOfBoundsError: Index (1) exceeds the length of the collection (4).

[Killed] ArithmeticOperator
src/data-structures/skip-list.ts:355:11
       const nextNode = node.next;
       node.nextLength = !IsValidFiniteNumber(node.nextLength)
         ? undefined
-        : node.nextLength! - 1;
+        : node.nextLength! + 1;
       // Stryker disable next-line OptionalChaining: caught as TypeError
       // Stryker disable next-line ConditionalExpression: optimization
killedBy: skip list at (indexing) short fixed list returns the correct value for each index after one remove operation
statusReason: MissingIndexError: Skip list is not formed correctly, lacks index: 1.

[Killed] EqualityOperator
src/data-structures/skip-list.ts:358:11
         : node.nextLength! - 1;
       // Stryker disable next-line OptionalChaining: caught as TypeError
       // Stryker disable next-line ConditionalExpression: optimization
-      if (nextNode?.data === newHeadValue) {
+      if (nextNode?.data !== newHeadValue) {
         // remove the next node since it will be a duplicate of the new head
         // node
killedBy: skip list remove short fixed list completely removes the head column when targeting the head value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    2,
+   2,

[Killed] BlockStatement
src/data-structures/skip-list.ts:358:44
         : node.nextLength! - 1;
       // Stryker disable next-line OptionalChaining: caught as TypeError
       // Stryker disable next-line ConditionalExpression: optimization
-      if (nextNode?.data === newHeadValue) {
-        // remove the next node since it will be a duplicate of the new head
-        // node
-        this.#removeNextNode(node, nextNode);
-        // undo the decrementing of node.nextLength, since we are removing a
-        // duplicate node
-        node.nextLength! += 1;
-      }
+      if (nextNode?.data === newHeadValue) {}
     }
   }
killedBy: skip list remove short fixed list completely removes the head column when targeting the head value
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    2,
+   2,

[Killed] AssignmentOperator
src/data-structures/skip-list.ts:364:9
         this.#removeNextNode(node, nextNode);
         // undo the decrementing of node.nextLength, since we are removing a
         // duplicate node
-        node.nextLength! += 1;
+        node.nextLength! -= 1;
       }
     }
killedBy: skip list at (indexing) short fixed list returns the correct value for each index after one remove operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 5

[Killed] BlockStatement
src/data-structures/skip-list.ts:369:69
     }
   }
 
-  #removeNextNode(node: SkipListNode<T>, nextNode: SkipListNode<T>) {
-    node.next = nextNode.next;
-    // Stryker disable next-line ConditionalExpression: prevents NaN assignment
-    if (!IsValidFiniteNumber(nextNode.nextLength)) {
-      node.nextLength = undefined;
-    } else {
-      node.nextLength! += nextNode.nextLength! - 1;
-    }
-    deleteObjectProperties(nextNode);
-  }
+  #removeNextNode(node: SkipListNode<T>, nextNode: SkipListNode<T>) {}
 
   get values(): ReadonlyArray<T> {
killedBy: skip list remove short fixed list completely removes the correct element from the list when targeting a value that is neither at the start nor end of the list
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    1,
    2,

[Killed] BooleanLiteral
src/data-structures/skip-list.ts:372:9
   #removeNextNode(node: SkipListNode<T>, nextNode: SkipListNode<T>) {
     node.next = nextNode.next;
     // Stryker disable next-line ConditionalExpression: prevents NaN assignment
-    if (!IsValidFiniteNumber(nextNode.nextLength)) {
+    if (IsValidFiniteNumber(nextNode.nextLength)) {
       node.nextLength = undefined;
     } else {
killedBy: skip list at (indexing) short fixed list returns the correct value for each index after one remove operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 5

[Killed] BlockStatement
src/data-structures/skip-list.ts:372:52
   #removeNextNode(node: SkipListNode<T>, nextNode: SkipListNode<T>) {
     node.next = nextNode.next;
     // Stryker disable next-line ConditionalExpression: prevents NaN assignment
-    if (!IsValidFiniteNumber(nextNode.nextLength)) {
-      node.nextLength = undefined;
-    } else {
+    if (!IsValidFiniteNumber(nextNode.nextLength)) {} else {
       node.nextLength! += nextNode.nextLength! - 1;
     }
killedBy: skip list at (indexing) short fixed list returns the correct value for each index after one remove operation
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] BlockStatement
src/data-structures/skip-list.ts:374:12
     // Stryker disable next-line ConditionalExpression: prevents NaN assignment
     if (!IsValidFiniteNumber(nextNode.nextLength)) {
       node.nextLength = undefined;
-    } else {
-      node.nextLength! += nextNode.nextLength! - 1;
-    }
+    } else {}
     deleteObjectProperties(nextNode);
   }
killedBy: skip list at (indexing) short fixed list returns the correct value for each index after one remove operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 4

[Killed] AssignmentOperator
src/data-structures/skip-list.ts:375:7
     if (!IsValidFiniteNumber(nextNode.nextLength)) {
       node.nextLength = undefined;
     } else {
-      node.nextLength! += nextNode.nextLength! - 1;
+      node.nextLength! -= nextNode.nextLength! - 1;
     }
     deleteObjectProperties(nextNode);
killedBy: skip list at (indexing) short fixed list returns the correct value for each index after one remove operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 5
