[Killed] ArithmeticOperator
src/data-structures/skip-list.ts:375:27
     if (!IsValidFiniteNumber(nextNode.nextLength)) {
       node.nextLength = undefined;
     } else {
-      node.nextLength! += nextNode.nextLength! - 1;
+      node.nextLength! += nextNode.nextLength! + 1;
     }
     deleteObjectProperties(nextNode);
killedBy: skip list at (indexing) short fixed list returns the correct value for each index after one remove operation
statusReason: MissingIndexError: Skip list is not formed correctly, lacks index: 1.

[Killed] BlockStatement
src/data-structures/skip-list.ts:380:34
     deleteObjectProperties(nextNode);
   }
 
-  get values(): ReadonlyArray<T> {
-    const array: Array<T> = [];
-    if (this.head === undefined) {
-      return array;
-    }
-    let lowestHeadNode: SkipListNode<T> | undefined = this.head;
-    while (lowestHeadNode.down !== undefined) {
-      lowestHeadNode = lowestHeadNode.down;
-    }
-    while (lowestHeadNode !== undefined) {
-      array.push(lowestHeadNode.data);
-      lowestHeadNode = lowestHeadNode.next;
-    }
-    return array;
-  }
+  get values(): ReadonlyArray<T> {}
 
   // Stryker disable all: toString overload used for testing
killedBy: skip list constructor empty array collection parameter passed in values getter return an empty array for an empty skip list
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] EqualityOperator
src/data-structures/skip-list.ts:382:9
 
   get values(): ReadonlyArray<T> {
     const array: Array<T> = [];
-    if (this.head === undefined) {
+    if (this.head !== undefined) {
       return array;
     }
killedBy: skip list constructor empty array collection parameter passed in values getter return an empty array for an empty skip list
statusReason: TypeError: Cannot read properties of undefined (reading 'down')

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:382:9
 
   get values(): ReadonlyArray<T> {
     const array: Array<T> = [];
-    if (this.head === undefined) {
+    if (false) {
       return array;
     }
killedBy: skip list constructor empty array collection parameter passed in values getter return an empty array for an empty skip list
statusReason: TypeError: Cannot read properties of undefined (reading 'down')

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:386:12
       return array;
     }
     let lowestHeadNode: SkipListNode<T> | undefined = this.head;
-    while (lowestHeadNode.down !== undefined) {
+    while (false) {
       lowestHeadNode = lowestHeadNode.down;
     }
killedBy: skip list constructor includes fixed collection params returns the correct values for the lowest layer
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Array [
    1,
    2,

[Killed] EqualityOperator
src/data-structures/skip-list.ts:386:12
       return array;
     }
     let lowestHeadNode: SkipListNode<T> | undefined = this.head;
-    while (lowestHeadNode.down !== undefined) {
+    while (lowestHeadNode.down === undefined) {
       lowestHeadNode = lowestHeadNode.down;
     }
killedBy: skip list constructor includes fixed collection params returns the correct values for the lowest layer
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Array [
    1,
    2,

[Killed] EqualityOperator
src/data-structures/skip-list.ts:389:12
     while (lowestHeadNode.down !== undefined) {
       lowestHeadNode = lowestHeadNode.down;
     }
-    while (lowestHeadNode !== undefined) {
+    while (lowestHeadNode === undefined) {
       array.push(lowestHeadNode.data);
       lowestHeadNode = lowestHeadNode.next;
killedBy: skip list constructor includes fixed collection params returns the correct values for the lowest layer
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   1,
-   2,

[Killed] ConditionalExpression
src/data-structures/skip-list.ts:389:12
     while (lowestHeadNode.down !== undefined) {
       lowestHeadNode = lowestHeadNode.down;
     }
-    while (lowestHeadNode !== undefined) {
+    while (false) {
       array.push(lowestHeadNode.data);
       lowestHeadNode = lowestHeadNode.next;
killedBy: skip list constructor includes fixed collection params returns the correct values for the lowest layer
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   1,
-   2,
