[Killed] BlockStatement
src/data-structures/stack.ts:22:19
   #array: Array<ElementType> = [];
 
   constructor(iterable?: Iterable<ElementType>) {
-    if (iterable) {
-      this.#array = Array.from(iterable);
-    }
+    if (iterable) {}
   }
 
killedBy: stack (array implementation) constructor should successfully initialize the elements of a stack given an iterable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] BlockStatement
src/data-structures/stack.ts:27:27
     }
   }
 
-  push(item: ElementType) {
-    this.#array.push(item);
-  }
+  push(item: ElementType) {}
 
   pop() {
killedBy: stack (array implementation) push, pop, top popping elements off of an empty stack should not change the length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/data-structures/stack.ts:31:9
     this.#array.push(item);
   }
 
-  pop() {
-    return this.#array.pop();
-  }
+  pop() {}
 
   get top() {
killedBy: stack (array implementation) constructor should successfully initialize the elements of a stack given an iterable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] BlockStatement
src/data-structures/stack.ts:35:13
     return this.#array.pop();
   }
 
-  get top() {
-    return this.#array.at(this.#array.length - 1);
-  }
+  get top() {}
 
   get isEmpty() {
killedBy: stack (array implementation) push, pop, top should successfully push an element onto an empty stack
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 221
Received: undefined

[Killed] ArithmeticOperator
src/data-structures/stack.ts:36:27
   }
 
   get top() {
-    return this.#array.at(this.#array.length - 1);
+    return this.#array.at(this.#array.length + 1);
   }
 
killedBy: stack (array implementation) push, pop, top should successfully push an element onto an empty stack
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 799
Received: undefined

[Killed] BlockStatement
src/data-structures/stack.ts:39:17
     return this.#array.at(this.#array.length - 1);
   }
 
-  get isEmpty() {
-    return this.#array.length === 0;
-  }
+  get isEmpty() {}
 
   get length() {
killedBy: stack (array implementation) isEmpty should indicate that an empty stack is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
src/data-structures/stack.ts:40:12
   }
 
   get isEmpty() {
-    return this.#array.length === 0;
+    return this.#array.length !== 0;
   }
 
killedBy: stack (array implementation) isEmpty should indicate that an empty stack is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/data-structures/stack.ts:43:16
     return this.#array.length === 0;
   }
 
-  get length() {
-    return this.#array.length;
-  }
+  get length() {}
 }
 
killedBy: stack (array implementation) push, pop, top popping elements off of an empty stack should not change the length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/data-structures/stack.ts:52:49
   #list: SinglyLinkedList<ElementType>;
   #length: number = 0;
 
-  constructor(iterable?: Iterable<ElementType>) {
-    this.#list = new SinglyLinkedList<ElementType>();
-    if (iterable) {
-      for (const item of iterable) {
-        this.push(item);
-      }
-    }
-  }
+  constructor(iterable?: Iterable<ElementType>) {}
 
   push(item: ElementType) {
killedBy: stack (LinkedList implementation) constructor should successfully initialize the elements of a stack given an iterable
statusReason: TypeError: Cannot read properties of undefined (reading 'root')

[Killed] ConditionalExpression
src/data-structures/stack.ts:54:9
 
   constructor(iterable?: Iterable<ElementType>) {
     this.#list = new SinglyLinkedList<ElementType>();
-    if (iterable) {
+    if (true) {
       for (const item of iterable) {
         this.push(item);
killedBy: stack (LinkedList implementation) push, pop, top popping elements off of an empty stack should not change the length
statusReason: TypeError: iterable is not iterable

[Killed] BlockStatement
src/data-structures/stack.ts:54:19
 
   constructor(iterable?: Iterable<ElementType>) {
     this.#list = new SinglyLinkedList<ElementType>();
-    if (iterable) {
-      for (const item of iterable) {
-        this.push(item);
-      }
-    }
+    if (iterable) {}
   }
 
killedBy: stack (LinkedList implementation) constructor should successfully initialize the elements of a stack given an iterable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] BlockStatement
src/data-structures/stack.ts:55:36
   constructor(iterable?: Iterable<ElementType>) {
     this.#list = new SinglyLinkedList<ElementType>();
     if (iterable) {
-      for (const item of iterable) {
-        this.push(item);
-      }
+      for (const item of iterable) {}
     }
   }
killedBy: stack (LinkedList implementation) constructor should successfully initialize the elements of a stack given an iterable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] BlockStatement
src/data-structures/stack.ts:61:27
     }
   }
 
-  push(item: ElementType) {
-    this.#length += 1;
-    this.#list.insertBeginning(new SinglyLinkedNode<ElementType>(item));
-  }
+  push(item: ElementType) {}
 
   pop() {
killedBy: stack (LinkedList implementation) constructor should successfully initialize the elements of a stack given an iterable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] AssignmentOperator
src/data-structures/stack.ts:62:5
   }
 
   push(item: ElementType) {
-    this.#length += 1;
+    this.#length -= 1;
     this.#list.insertBeginning(new SinglyLinkedNode<ElementType>(item));
   }
killedBy: stack (LinkedList implementation) push, pop, top popping elements off of an empty stack should not change the length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] BlockStatement
src/data-structures/stack.ts:66:9
     this.#list.insertBeginning(new SinglyLinkedNode<ElementType>(item));
   }
 
-  pop() {
-    const value = this.#list.root?.data;
-    this.#list.removeBeginning();
-    if (value !== undefined) {
-      this.#length -= 1;
-    }
-    return value;
-  }
+  pop() {}
   get top() {
     return this.#list.root?.data;
killedBy: stack (LinkedList implementation) constructor should successfully initialize the elements of a stack given an iterable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] OptionalChaining
src/data-structures/stack.ts:67:19
   }
 
   pop() {
-    const value = this.#list.root?.data;
+    const value = this.#list.root.data;
     this.#list.removeBeginning();
     if (value !== undefined) {
killedBy: stack (LinkedList implementation) push, pop, top popping elements off of an empty stack should not change the length
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] EqualityOperator
src/data-structures/stack.ts:69:9
   pop() {
     const value = this.#list.root?.data;
     this.#list.removeBeginning();
-    if (value !== undefined) {
+    if (value === undefined) {
       this.#length -= 1;
     }
killedBy: stack (LinkedList implementation) push, pop, top popping elements off of an empty stack should not change the length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
src/data-structures/stack.ts:74:13
     }
     return value;
   }
-  get top() {
-    return this.#list.root?.data;
-  }
+  get top() {}
   get isEmpty() {
     return this.#list.root === undefined;
killedBy: stack (LinkedList implementation) push, pop, top should successfully push an element onto an empty stack
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 142
Received: undefined

[Killed] OptionalChaining
src/data-structures/stack.ts:75:12
     return value;
   }
   get top() {
-    return this.#list.root?.data;
+    return this.#list.root.data;
   }
   get isEmpty() {
killedBy: stack (LinkedList implementation) push, pop, top should return undefined for the top element of an empty stack
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] BlockStatement
src/data-structures/stack.ts:80:16
   get isEmpty() {
     return this.#list.root === undefined;
   }
-  get length() {
-    return this.#length;
-  }
+  get length() {}
 }
 
killedBy: stack (LinkedList implementation) push, pop, top popping elements off of an empty stack should not change the length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined
