[Killed] BlockStatement
src/util.ts:12:68
   RelativeIndexable<ElementType> &
   HasLength;
 
-export const deleteObjectProperties = (obj: object | undefined) => {
-  for (const prop in obj) {
-    delete obj[prop as keyof typeof obj];
-  }
-};
+export const deleteObjectProperties = (obj: object | undefined) => {};
 
 export function IsValidFiniteNumber(value: number | undefined) {
killedBy: singly linked list with 1 element removeBeginning deletes the root node's properties
statusReason: Error: expect(received).not.toHaveProperty(path)

Expected path: not "next"

Received value: undefined

[Killed] BlockStatement
src/util.ts:13:27
   HasLength;
 
 export const deleteObjectProperties = (obj: object | undefined) => {
-  for (const prop in obj) {
-    delete obj[prop as keyof typeof obj];
-  }
+  for (const prop in obj) {}
 };
 
killedBy: singly linked list with 1 element removeBeginning deletes the root node's properties
statusReason: Error: expect(received).not.toHaveProperty(path)

Expected path: not "next"

Received value: undefined

[Killed] BlockStatement
src/util.ts:18:64
   }
 };
 
-export function IsValidFiniteNumber(value: number | undefined) {
-  return Number.isFinite(Number(value));
-}
+export function IsValidFiniteNumber(value: number | undefined) {}
 
 export const isDefinedAndNotNaN = (value: unknown) => {
killedBy: skip list at (indexing) short fixed list returns the correct value for each index after one remove operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 4

[Killed] BlockStatement
src/util.ts:22:55
   return Number.isFinite(Number(value));
 }
 
-export const isDefinedAndNotNaN = (value: unknown) => {
-  if (
-    value === undefined ||
-    (typeof value === "number" && isNaN(Number(value)))
-  ) {
-    return false;
-  }
-  return true;
-};
+export const isDefinedAndNotNaN = (value: unknown) => {};
 
 export function isSorted<ElementType>(collection: Collection<ElementType>) {
killedBy: undefined/NaN detection isDefinedAndNotNaN should return false if the input is undefined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] LogicalOperator
src/util.ts:24:5
 
 export const isDefinedAndNotNaN = (value: unknown) => {
   if (
-    value === undefined ||
-    (typeof value === "number" && isNaN(Number(value)))
+    value === undefined && typeof value === "number" && isNaN(Number(value))
   ) {
     return false;
killedBy: undefined/NaN detection isDefinedAndNotNaN should return false if the input is undefined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/util.ts:24:5
 
 export const isDefinedAndNotNaN = (value: unknown) => {
   if (
-    value === undefined ||
+    value !== undefined ||
     (typeof value === "number" && isNaN(Number(value)))
   ) {
killedBy: undefined/NaN detection isDefinedAndNotNaN should return false if the input is undefined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/util.ts:25:6
 export const isDefinedAndNotNaN = (value: unknown) => {
   if (
     value === undefined ||
-    (typeof value === "number" && isNaN(Number(value)))
+    (typeof value !== "number" && isNaN(Number(value)))
   ) {
     return false;
killedBy: undefined/NaN detection isDefinedAndNotNaN should return false if the input is NaN (with type number)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/util.ts:25:6
 export const isDefinedAndNotNaN = (value: unknown) => {
   if (
     value === undefined ||
-    (typeof value === "number" && isNaN(Number(value)))
+    (true && isNaN(Number(value)))
   ) {
     return false;
killedBy: undefined/NaN detection isDefinedAndNotNaN should return true for a variety of defined non-numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/util.ts:26:5
   if (
     value === undefined ||
     (typeof value === "number" && isNaN(Number(value)))
-  ) {
-    return false;
-  }
+  ) {}
   return true;
 };
killedBy: undefined/NaN detection isDefinedAndNotNaN should return false if the input is undefined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/util.ts:32:76
   return true;
 };
 
-export function isSorted<ElementType>(collection: Collection<ElementType>) {
-  // Stryker disable next-line EqualityOperator
-  for (let i = 1; i < collection.length; i++) {
-    if (collection.at(i)! < collection.at(i - 1)!) {
-      return false;
-    }
-  }
-  return true;
-}
+export function isSorted<ElementType>(collection: Collection<ElementType>) {}
 
 export const arrayCopyToFunction: CollectionCopyToFunction<number> = (
killedBy: selection sort sorts through the final element of the input array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
src/util.ts:34:47
 
 export function isSorted<ElementType>(collection: Collection<ElementType>) {
   // Stryker disable next-line EqualityOperator
-  for (let i = 1; i < collection.length; i++) {
-    if (collection.at(i)! < collection.at(i - 1)!) {
-      return false;
-    }
-  }
+  for (let i = 1; i < collection.length; i++) {}
   return true;
 }
killedBy: selection sort successfully sorts a large array containing only unique elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] UpdateOperator
src/util.ts:34:42
 
 export function isSorted<ElementType>(collection: Collection<ElementType>) {
   // Stryker disable next-line EqualityOperator
-  for (let i = 1; i < collection.length; i++) {
+  for (let i = 1; i < collection.length; i--) {
     if (collection.at(i)! < collection.at(i - 1)!) {
       return false;
killedBy: selection sort sorts through the final element of the input array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/util.ts:35:9
 export function isSorted<ElementType>(collection: Collection<ElementType>) {
   // Stryker disable next-line EqualityOperator
   for (let i = 1; i < collection.length; i++) {
-    if (collection.at(i)! < collection.at(i - 1)!) {
+    if (collection.at(i)! <= collection.at(i - 1)!) {
       return false;
     }
killedBy: selection sort successfully sorts a large array containing duplicate elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/util.ts:35:9
 export function isSorted<ElementType>(collection: Collection<ElementType>) {
   // Stryker disable next-line EqualityOperator
   for (let i = 1; i < collection.length; i++) {
-    if (collection.at(i)! < collection.at(i - 1)!) {
+    if (false) {
       return false;
     }
killedBy: selection sort successfully sorts a large array containing only unique elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/util.ts:36:14
   // Stryker disable next-line EqualityOperator
   for (let i = 1; i < collection.length; i++) {
     if (collection.at(i)! < collection.at(i - 1)!) {
-      return false;
+      return true;
     }
   }
killedBy: selection sort successfully sorts a large array containing only unique elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/util.ts:47:6
   toCollection: Collection<number>,
   fromIndex: Index,
   toIndex: Index,
-) => {
-  const fromArray = fromCollection as Array<number>;
-  const toArray = toCollection as Array<number>;
-  toArray[toIndex] = fromArray[fromIndex];
-};
+) => {};
 
 export const arrayEmptyConstructor: CollectionConstructor<number> = (
killedBy: merge sort sorts an unsorted array containing 2 unique positive elements
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [2881, 2870]
