[Killed] BlockStatement
src/data-structures/linked-list.ts:13:31
 export class List<T> {
   root?: Node<T>;
 
-  constructor(root?: Node<T>) {
-    this.root = root;
-  }
+  constructor(root?: Node<T>) {}
 
   insertBeginning(newRoot: Node<T>) {
killedBy: singly linked list constructor successfully assigns root node when one is provided
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not 0

[Killed] BlockStatement
src/data-structures/linked-list.ts:17:37
     this.root = root;
   }
 
-  insertBeginning(newRoot: Node<T>) {
-    newRoot.child = this.root;
-    this.root = newRoot;
-  }
+  insertBeginning(newRoot: Node<T>) {}
 
   get length() {
killedBy: singly linked list insertBeginning sets newRoot as the root for an empty linked list
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] BlockStatement
src/data-structures/linked-list.ts:22:16
     this.root = newRoot;
   }
 
-  get length() {
-    let count = 0;
-    let current = this.root;
-    while (current !== undefined) {
-      count += 1;
-      current = current.child;
-    }
-    return count;
-  }
+  get length() {}
 
   [Symbol.iterator]() {
killedBy: singly linked list constructor successfully assigns root node when one is provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/data-structures/linked-list.ts:32:23
     return count;
   }
 
-  [Symbol.iterator]() {
-    let current = this.root;
-    return {
-      next() {
-        if (current === undefined) {
-          return { value: undefined, done: true };
-        }
-        const result = { value: current, done: false };
-        current = current.child;
-        return result;
-      },
-    };
-  }
+  [Symbol.iterator]() {}
 
   // Made this method static since it doesn't rely upon the 
killedBy: singly linked list empty linked list is not iterable
statusReason: TypeError: Result of the Symbol.iterator method is not an object

[Killed] BlockStatement
src/data-structures/linked-list.ts:35:14
   [Symbol.iterator]() {
     let current = this.root;
     return {
-      next() {
-        if (current === undefined) {
-          return { value: undefined, done: true };
-        }
-        const result = { value: current, done: false };
-        current = current.child;
-        return result;
-      },
+      next() {},
     };
   }
killedBy: singly linked list empty linked list is not iterable
statusReason: TypeError: Iterator result undefined is not an object

[Killed] ConditionalExpression
src/data-structures/linked-list.ts:36:13
     let current = this.root;
     return {
       next() {
-        if (current === undefined) {
+        if (false) {
           return { value: undefined, done: true };
         }
killedBy: singly linked list empty linked list is not iterable
statusReason: TypeError: Cannot read properties of undefined (reading 'child')

[Killed] BlockStatement
src/data-structures/linked-list.ts:48:58
 
   // Made this method static since it doesn't rely upon the 
   // instance's state and is more of a utility function
-  static insertAfter<E>(node: Node<E>, newNode: Node<E>) {
-    newNode.child = node.child;
-    node.child = newNode;
-  }
+  static insertAfter<E>(node: Node<E>, newNode: Node<E>) {}
 }
 
killedBy: singly linked list with 3 elements insertAfter places newNode in correct position
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 2
